low = ["反弹难持续","布局空单","空头持有","偏弱震荡","偏弱", "下滑", "弱势", "下行", "走弱", "做空", "偏空", "下跌", "试空", "短空", "空单操作", "偏弱","向下压力较大","空头思路","抛空为主","反弹抛空",
       "逐步布空","承压", "超涨", "沽空", "回吐", "逢高空", "下破", "跳水", "弱调整", "弱趋势", "冲低", "上冲", "赶底", "走低", "大跌", "布局空单", "持空","下调",
       "高抛","空单继续持有","回调整理","空单持有","鹰派信号","压制铜价","持续偏弱","关注做空机会","逢高空","震荡趋弱"]
high = ["布局多单","偏强震荡","重归反弹","继续向上","向上突破","破新高","多TA", "偏强", "上涨", "走强", "偏多", "做多", "试多", "上行", "乐观", "强势", "走强", "提振", "坚挺","探底回升","企稳反弹"
        "反弹", "回升", "短多", "多单操作", "超跌", "沽多", "逢低多", "上破", "强调整", "冲高", "下冲", "赶顶", "走高", "大涨", "布局多单", "持多","逢低多",
        "上调","多单继续持有","多单背靠","谨慎看多","逢低增持","双向回归","期价反弹","触底反弹", "继续反弹","向上修复","减仓反弹","底部反弹","支撑较强","逢低买入","多头思路","价格反弹","历史新高","关注做多机会"]
to_continue = ["才可能企稳回升","才可能企稳","议做多裂解价差","加工差承压","开工下滑","难提振","FU偏强","油价压力",
                "油粕比空单","基差回落","未透露更多鹰派信号","等待价格企稳","产量回升","价差有望走强",
                "防范价格下跌风险","价差有望走强","难以大幅走高","短线的回落","回调的风险","加工费回调空间有限"]
zero = ["震荡对待","上行空间受限","下行空间受限","波动风险加大","震荡为主","高位震荡","盘面震荡","反弹空间有限","反弹幅度已经较高",
                "反弹难持续","跟涨情绪减弱","阶段性震荡","震荡中","上行空间有限","下行空间有限",
                "底部空间或将有限","短期内震荡行情","呈现震荡格局","震荡走势为主","震荡整理","反复震荡",
                "宽幅震荡运行","横盘震荡为主","低位宽幅震荡","震荡为主","后期主要关注","仍有反复",
                "上行阻力依然较大","维持区间震荡", "交割因素扰动","不建议空单操作","不建议多单操作",
                "需要重点关注","锁定利润","旺季不旺","缺乏后劲","小幅整理","上行告一段落",
                "下行告一段落","风险尚存","震荡运行","低位震荡","上行有限","下行有限",
                "多看少动","不做方向性预期","窄幅震荡","上涨驱动弱","暂时观望","难言乐观","短线震荡",
                "横盘整理","延续振荡","延续震荡表现","高位区间震荡","上行驱动不足","维持震荡走势","上行动力不足",
                "仍难打破震荡形态","等待企稳","高抛低吸","短线交易为主","建议暂观望","整体震荡","多单逢高减仓","单边头寸谨慎",
                "单边观望","做空驱动不足","价格震荡","反弹行情阶段性结束","轻仓过节","减仓交易",
                "高位反复","空仓","震荡行情将延续","跟随原油为主","震荡思路操作","逢高止盈","有一定反复","跟随油价震荡",
                "回归整理区间","贵金属波动加大","空单可部分止盈","短线操作为宜","短线交易","震荡走势","跟随油价波动","短线操作",
                "建议观望为主","向上空间或有限","缺乏基本面驱动","宽幅运行","谨慎操作","不建议虚盘操作","短期中性",
                "尚未出现短缺","建议轻仓操作","高点很难预估","下行空间或有限","中性为主","维持震荡趋势","震荡思路对待",
                "谨慎对待","定投方式参与","两难境地","继续调整","下方空间有限","强现实弱" ,"出现反复","盘面看震荡",
                "区间操作","持续上涨动能不足","谨防冲高回落","上行承压", "上行乏力", "震荡对待", "先扬后抑", "短期反弹,趋势偏弱", "下行驱动逐渐放缓",
                "反弹难持续", "上行空间受限", "暂无利好"]
point_8 = ["短期反弹,趋势偏弱","先扬后抑","近强远弱","底部价格已现","底部已现","短线持多",
                "短多看待","多单轻仓持有","产生支撑","修复回补","小幅走强","需求回暖",
                "小幅反弹","短线多单参与","限制价格回落","仍有上冲基础","结构性反弹","保持强势运行",
                "利多","短线多单","价格中枢上移","利润向上修复","较强支撑","止跌回涨"]
point_7 = ["多头谨慎持有","偏涨看待","中长期多头配置","短多交易为主","逢低做多","逢低试多","供需偏紧"]
point_5 = ["多单谨慎持有","低点支撑","涨势趋缓","仍较抗跌","反弹幅度有限","短多长空",
                "不宜过分看多","不过于追多","被动涨势","反弹谨慎","反弹偏谨慎","谨慎乐观","多单谨慎",
                "多EG","谨慎追涨","回调幅度有限","不宜追多","短线炒作","支撑尚存","上方空间有限","炒作未止",
                "易涨难跌","仍偏强","多单轻仓","谨慎追多","形成托底","多单少量参与","支撑盘面","多单滚动操作",
                "持有前期多单","轻多尝试","反弹强度不及","回调买入","重心上移","轻仓多单持有"]
point_3 = ["买近抛远","短空止盈","高位运行","有支撑","延续高位运行","下跌之后反弹",
            "空单止盈","不宜过度追高","震荡止跌"]
point_neg_8 = ["近弱远强","顶部价格已现","顶部已现","反弹后抛空","逢高抛空","空单轻仓持有",
                "短线空单参与","维持偏空思路","逢高轻仓试空","卖出套保头寸"]
point_neg_7 = ["回落","回调","短期压力加剧"]
point_neg_5 = ["下行驱动逐渐放缓","弱平衡","不过于追空","空单谨慎","谨慎承压","有回调可能","压制期价上行","价格承压",
                "中期看空","等待机会做空","继续回调","偏空对待","长线偏空",
                "上行空间也较为有限","轻仓做空","重心下移","下调风险",
                "空单谨慎持有","不宜过分看跌","限制价格回升","短空长多","谨慎悲观","贴水继续走弱"]
point_neg_3 = ["短多止盈","高位调整压力","上行压力加大","上行动能不足","难有向上驱动",
                "多单止盈","压制上行空间","多单离场"]

import jieba


for i in low:
    jieba.add_word(i)
for i in high:
    jieba.add_word(i)
for i in to_continue:
    jieba.add_word(i)
for i in zero:
    jieba.add_word(i)
for i in point_8:
    jieba.add_word(i)
for i in point_7:
    jieba.add_word(i)
for i in point_5:
    jieba.add_word(i)
for i in point_3:
    jieba.add_word(i)
for i in point_neg_8:
    jieba.add_word(i)
for i in point_neg_7:
    jieba.add_word(i)
for i in point_neg_5:
    jieba.add_word(i)
for i in point_neg_3:
    jieba.add_word(i)


def simplify_sent(c):
    if "短期" in c and "中期" in c.split("短期")[1]:
        c = c.split("中期")[0]
    if "短期" in c and "长期" in c.split("短期")[1]:
        c = c.split("长期")[0]
    if "短期" in c and "中长期" in c.split("短期")[1]:
        c = c.split("中长期")[0]
    cut = jieba.cut(c)
    cut_list = []
    for i in cut:
        cut_list.append(i)
    cut_list.reverse()
    for c in cut_list:
        continued = False
        for i in to_continue:
            if i in c:
                continued = True
                break
        if continued:
            continue
        for i in zero:
            if i in c:
                return "0"
        if "滚动操作" in c and "多单滚动操作" not in c and "空单滚动操作" not in c:
            return "0"
        if "持续震荡" in c and "持续震荡偏弱" not in c and "持续震荡偏强" not in c:
            return "0"
        for i in point_8:
            if i in c:
                return "0.8"
        for i in point_7:
            if i in c:
                return "0.7"
        for i in point_5:
            if i in c:
                return "0.5"
        for i in point_3:
            if i in c:
                return "0.3"
        for i in point_neg_8:
            if i in c:
                return "-0.8"
        for i in point_neg_7:
            if i in c:
                return "-0.7"
        for i in point_neg_5:
            if i in c:
                return "-0.5"
        for i in point_neg_3:
            if i in c:
                return "-0.3"
        for i in high:
            if i in c:
                return "1"
        for i in low:
            if i in c:
                return "-1"
    return "0"