low = ["反弹难持续","布局空单","空头持有","偏弱震荡","偏弱", "下滑", "弱势", "下行", "走弱", "做空", "偏空", "下跌", "试空", "短空", "空单操作", "偏弱","向下压力较大","空头思路","抛空为主","反弹抛空",
       "逐步布空","承压", "超涨", "沽空", "回吐", "逢高空", "下破", "跳水", "弱调整", "弱趋势", "冲低", "止损上冲", "赶底", "走低", "大跌", "布局空单", "持空","下调",
       "高抛","反弹空","继续下挫","继续受挫","下挫","进一步下挫","施压","空单继续持有","偏弱运行","回调整理","空单持有","鹰派信号","压制铜价","持续偏弱","关注做空机会","逢高空","震荡趋弱"]
high = ["布局多单","偏强震荡","重归反弹","继续向上","向上突破","破新高","多TA", "偏强", "上涨", "走强", "偏多", "做多", "试多", "上行", "乐观", "强势", "走强", "提振", "坚挺","探底回升","企稳反弹","存在反弹机会",
        "反弹", "回升", "短多", "多单操作", "超跌", "沽多", "逢低多", "上破", "强调整", "冲高", "下冲", "赶顶", "走高", "大涨", "布局多单", "持多","逢低多", "反弹修复","多单参与","多单参与为主","以超跌做多",
        "上调","多单继续持有","多单背靠","谨慎看多","逢低增持","双向回归","期价反弹","触底反弹", "继续反弹","向上修震荡向上复","减仓反弹","底部反弹","支撑较强","逢低买入","多头思路","价格反弹","历史新高",\
        "关注做多机会","利好短期价格","多单可以继续持有","多单持有","继续爬升","利润持续修复"]
to_continue = ["才可能企稳回升","中长线偏空","才可能企稳","基差快速回落","偏多9","长期维持逢高沽空","中期或震荡偏弱","做多裂解价差","加工差承压","需求超预期回升","果价格大幅下滑","反弹需现货","开工下滑","难提振","风险原油继续下跌","供需预期仍偏弱",
               "做多螺矿比","不过原油大跌","企稳回升仍需","长期仍有上涨做多","内外比值回升","情绪降温后","供应回升","裂解多头介入","关注疫情控制及需求回暖情况","价格是否下行","中期能否上涨","可做多螺矿比","注意原油反弹","等待回调低位做多利润","FU偏强","油价压力","回调风险逐步降低","积极性回升","下跌主要来自","产能回升的压力",
                "油粕比空单","基差回落","未透露更多鹰派信号","反弹压力下移","等待价格企稳","产量回升","基差有所反弹","价差有望走强","乳胶水高位回落","在价格上涨时","基差走弱","比值或将走强","做多短纤与","随着原料下跌",
               "胀预期回落","外盘下跌","上涨的兑现以后","中期还是偏空","若成品油价格回落则将带动原油走低","库存回升情况","受棕油回落影响","注意过度下跌后的反弹","做多硅锰空硅铁套",
               "警惕回落风险","交易量较节前有所回落","锰矿超预期上涨","套保空单可逢高介入","注意原油回落","盘面回调后","下行风险为","风险是原油反弹","反弹关注上方","煤炭价格继续上涨","逢低做多MTO利润","价差有所反弹","反套可止盈离场",
               "极性回升","不锈钢价格的上涨","在油价反弹期间","等待利多的基本面","正套逐步止盈","做多钢厂利润","关注现货回落节点","结合油价下跌","逢低做多短纤与","谨防随时承压回落","月底交割之后市场情绪回落","上行空间一是",
               "产业客户等待回落","套利:观望","升水能够有所回落","价差亦随之走低","中期价格触底","做多短纤与 PTA 价差","随着焦炭价格下跌","能否出现明显反弹","以防价格下跌带来的风险","价差或会走低","套利:观望","警惕盘面价格快速回升",
                "防范价格下跌风险","反弹压力参考","差逢高止盈","价差多单","基差的走强","观察周末反弹的持续性","价差有望走强","难以大幅走高","做多油粕比","关注现货反弹","短线的回落","中长期偏空","回调的风险","加工费回调空间有限","利润持续走低","逢低做多短纤与 PTA 价差","警惕期价连日上行后的回调风险"]
zero = ["震荡对待","上行空间受限","不建议追多","趋稳运行","做多情绪不强","单边日内交易","基差上涨","不建议参与","价格主要受成本端影响","未见上行驱动","继续跟随油价运行","底部位置的博弈","走势偏震荡","短多暂时离场","维持较为谨慎","下行空间受限","区域震荡","波动风险加大","震荡为主","高位震荡","关注上方压力与下方支撑","盘面震荡","反弹空间有限","反弹幅度已经较高","多TA空EG","价格承压阶段性","价格进入调整阶段",
                "反弹难持续","跟涨情绪减弱","维持1500-1600震荡","形成震荡","可获利了结","大方向跟随钢材","短线参与","不建议追空","基本面无明显驱动","暂不构成下行趋势","高抛低平","下挫或告一段落","阶段性震荡","关注当下产区生产供应变化","震荡中","暂不做判断","仍难有强势表现","成本端的影响较大","附近震荡","难有上涨动力","价格趋稳运行",
                "底部空间或将有限","带来不确定性","上行驱动弱","震荡看待","短期内震荡行情","做多下游利润","短期震荡思路","不宜追空","值得关注","呈现震荡格局","仍是震荡市","震荡走势为主","震荡整理","反复震荡","观望","宽幅震荡","走势震荡","受原料端影响较大","维持震荡策略","震荡思路","不建议继续追多",
                "宽幅震荡运行","横盘震荡为主","不宜追多","较大不确定性","多空博弈加剧","两粕菜油关注","震荡操作","日内短线","低位宽幅震荡","震荡为主","仍有反复","空头止盈离场","跌幅大小","一线上下震荡","价格跟随原料","基本面变化不大","震荡一段时间","维持高位盘整","等待市场企稳","提振效果不大",
                "上行阻力依然较大","维持观望","维持区间震荡","供需矛盾相对不大","交割因素扰动","不会再扩大跌幅","不建议空单操作","不建议多单操作","继续观望","反弹不可延续","震荡筑底","PX继续强势","维持震荡调整","逐渐企稳的概率较大",
                "锁定利润","旺季不旺","横盘窄幅波动","缺乏后劲","小幅整理","上行告一段落","或压制挤仓风险","不宜做空","反弹不可持续","日内短线参与","建议观望","反弹空间受限","警惕高位风险","限制远月合约上方空间",
                "下行告一段落","风险尚存","波段交易","浮法日熔下滑","附近做震荡","动或加剧","震荡运行","低位震荡","上行有限","下行有限","暂时观望","缺乏明显的供需矛盾","不建议做虚盘","反弹空间或有限","寻找平衡","关注终端恢复节奏","限制贵金属上行动力",
                "多看少动","出现跌幅趋缓或反弹","继续被动跟随原料","不做方向性预期","并非有利上涨","上行受限","窄幅震荡","附近徘徊","上涨驱动弱","暂时观望","难言乐观","抑制期货盘面持续下行的空间","短线震荡","表现震荡","上涨空间有限","下行趋势或可缓和","高位振荡运行",
                "建议观望","日内交易为主","上下两难的境地","主力区间","不建议单边操作","多空均有故事可讲","限制反弹高度","维持震荡","波动趋势运行","延续震荡","上行动力依旧不足","盘面抗跌","调整空间有限","被动跟随原料波动",
                "横盘整理","延续振荡","随油脂板块走势","短期可能处于震荡","短期或存在一定超跌","反弹乏力","震荡反复","延续震荡表现","宽幅波动为主","高位区间震荡","上行驱动不足","以套利为主","维持震荡走势","上行动力不足","区间震荡","做多钢厂利润","难有大跌","随成本端继续震荡","震荡调整","面临方向选择",
                "仍难打破震荡形态","等待企稳","观望为主","高抛低吸","短线交易为主","操作上建议保持谨慎","上行的驱动略显不足","建议暂观望","整体震荡","多单逢高减仓","在高位纠结","单边头寸谨慎","不会大跌","等待明朗","日内操作为宜","进入高位盘整走势",
                "单边观望","做空驱动不足","价格震荡","不温不火","调整空间或有限","反弹行情阶段性结束","转入整理格局","轻仓过节","减仓交易","基本面变化不大","进一步上涨的空间有限","操作仍需谨慎","做多的时机仍然未到","多单建议考虑暂时止盈",
                "高位反复","有望止跌","参与反弹风险仍较大","空仓","震荡行情将延续","参考运行区间","不抄底","跟随原油为主","震荡思路操作","逢高止盈","有一定反复","操作上建议观望","跟随油价震荡","不宜过分看空","高位运行","不建议进场追多","继续向下的空间更加有限",
                "回归整理区间","贵金属波动加大","空单可部分止盈","短线操作为宜","下跌空间有限","短线交易","震荡走势","跟随油价波动","短线操作","高位宽幅波动","震荡走势为主","限制上涨动能","难有走强动力",
                "建议观望为主","制约短期下行空间","空间有限","有望完成筑底","难大跌","向上空间或有限","继续关注外围市场的变化","缺乏基本面驱动","宽幅运行","谨慎操作","不建议虚盘操作","短期中性","持币观望","套保压力仍较大","反弹空间或受限","不建议买入","反弹可持续性不足",
                "尚未出现短缺","不建议再追空","建议轻仓操作","不建议单边做多","上行驱动较弱","高点很难预估","下行空间或有限","中性为主","维持震荡趋势","震荡思路对待","供求两淡","不建议单边追空","自身主导意愿并不强","高位盘整","高位整理","宽幅波动思路对待",
                "谨慎对待","定投方式参与","显现出下跌抵抗","两难境地","继续调整","继续震荡","下方空间有限","强现实弱" ,"出现反复","盘面看震荡","不具备做多的条件","保持震荡","转为震荡","低多高平","区间交易","处于震荡状态",
                "区间操作","持续上涨动能不足","反弹空间持谨慎态度","谨防冲高回落","上行承压", "上行乏力", "震荡对待", "先扬后抑", "短期反弹,趋势偏弱", "下行驱动逐渐放缓","本线附近震荡","震荡格局","波段操作",
                "反弹难持续","盘整","等待试多机会","等待低多机会","风险仍大于收益","合约震荡","主力合约震荡","轻仓参与震荡","不建议单边追空","窄幅整理","区间波动","区间调整为主","区间内短线参与","若能有所回落",
                "短期盘面呈震荡","续跌空间有限","上行空间受限", "建议观望","暂无利好","近月不追空","短期建议观望","等待行情","区间交易为主","不宜追空下跌近尾声","观望为主","理性等待","区间策略","底部震荡","震荡区间","上行空间或受限"]
point_8 = ["短期反弹,趋势偏弱","先扬后抑","近强远弱","底部价格已现","底部已现","短线持多","震荡偏强对待","短期新高",
                "短多看待","多单轻仓持有","产生支撑","修复回补","小幅走强","需求回暖","突破上方强压","合约多单","逢低建仓多单",
                "小幅反弹","买入操作","短线多单参与","仍有上冲基础","结构性反弹","保持强势运行","多单可考虑继续持有","多eb","利多玉米价格","多单择机进场",
                "利多","短线多单","价格中枢上移","利润向上修复","较强支撑","止跌回涨","多单建议继续持有", "多EB","多单重新入场"]
point_7 = ["多头谨慎持有","多头买入机会","偏涨看待","拉涨不锈钢","中长期多头配置","短多交易为主","逢低做多","反弹小周期应未结束","逢低试多","供需偏紧","生产收紧","逢低多","下游补库态度积极","支撑短期价格","缓慢上抬","多单短线持有","支撑铜价",
           "警惕多头逼仓风险","附近的买入机会","推升油价","刺激一波","下行空间料大于","难摆脱低迷走势","明显挤仓",
           "短期处于上攻","冲高风险","价格受支撑","抬升不锈钢期货价格","持续支撑","维持震荡上扬","具有低位做多驱动","逢回调做多","缓慢上涨","震荡向上",
           "参与做多行情","短多持有","低位多配","逢低布局远月","反弹回升","顺势空头","小步向上","走势偏强","多头敞口","利多短期价格", "低位多单可以轻仓持有", "回撤接多","重心震荡上移","成本持续推动","附近做多","预期向好","附近做多"]
point_5 = ["多单谨慎持有","波段多单","布局长多","反弹力度或有限","中长期看多","酝酿反弹机会","观望或短多","回落可止盈离场","节奏性做多","低点支撑","涨势趋缓","回调接多为主","仍较抗跌","估值修复思路对待","中线轻仓逢低买入","反弹幅度有限","滚动低多","短多长空","下游补库积极","冲高一波后再回落","跟随黄金","回调介入短多","置止损短多","政策面利好","支撑矿价","短期驱动向上",
           "短期获支撑","回落偏多","回调后的做多","技术性修正的需求","中枢上移","或有补贴水行情","利润有望继续修复","短线低吸","回调企稳逢低做多","中期多头配置","回调仍是买入机会","多头信心加强","贴水有收窄预期","震荡略偏强","难有大幅上涨的趋势性行情",
            "不过于追多","超跌反弹","回落试多","方可重新入场做多","短多或逢反弹减仓","中长线则看多黄金","被动涨势","等待低吸","反弹谨慎","逢低买","回调后的买入机会","反弹偏谨慎","谨慎乐观","多单谨慎","有情绪性买入价值","有支撑","大涨不追","到支撑作用","轻仓布局中长期多单","有一定支撑",
           "估值修复的可能","小幅上涨","易跟随情绪反弹","回落买入机会","谨慎反弹","重新关注多头逻辑","或有反弹","进一步抬升的可能性","关注估值低位回补的机会","多单可部分止盈","等待后期布局多单机会","盘面震荡向上","重心小幅上移",
           "上涨阻力增大","中线多单持有","或支撑价格","中长期偏多操作","中期做多机会","逢低轻仓参与反弹","支撑逐渐增强","上涨幅度恐有限","回落买入为主","不追高","价格存在支撑","回调企稳接多","震荡略偏多","价格小幅上移",
                "多EG","谨慎追涨","轻仓适当回调做","回撤接多为宜","回调幅度有限","考虑低多策略","不宜追多","短线炒作","支撑尚存","上方空间有限","炒作未止","逢高部分止盈","可尝试多单","期价仍受支撑","增强底部支撑","偏暖震荡",
           "反弹高度不乐观","逢低布局2209合约多单","逢低轻仓做多","低库存下的上涨弹性","回调去布局多单","暂时支撑铜价","小幅反弹","重心或小幅上移","基本面存支撑","等待回调做多机会","惜售心理增加","弱反弹走势","裂解价差高估","回调到位后做多",
                "易涨难跌","具有相当强劲的支撑","仍偏强","多单轻仓","有继续上移的条件","逢低轻仓买入","轻仓低多为主","谨慎追多","形成托底","多单少量参与","支撑盘面","多单滚动操作","一定提振作用","贴水收窄","远月驱动渐显","轻仓试多","可低吸","成本端支撑仍存",
                "持有前期多单","获得一定的支撑","观望或者搏一波反弹","回调后再度入多","轻多尝试","反弹强度不及","远月企稳谨慎偏多","回调买入","重心上移","轻仓多单持有","存在支撑","适量买入","逢低短多","轻多跟随","价格持续向上压力也在加大"]
point_3 = ["买近抛远","反弹力度总体有限","反弹的高度可能有限","不具备连续大幅上涨","向上反弹的阻力位","不具备持续大幅上涨","企稳态势","有所企稳","等待回调接多机会","后续做多机会需考量","带来的止跌企稳甚至反弹风险","低位企稳","高位维持","多单暂时离场","需求端改善","抑制原油价格飙升","反弹幅度受限","上行动能有限","涨幅正在遇阻","关注能否向上突破","高度有限","下方支撑渐显","不宜过分看多","短空止盈","下跌之后反弹","多单建议考虑逢高逐步止盈","反弹的高度受限","下行空间有限","回调空间有限","反弹高度将一般","做多性价比有限","上方空间或有限","多方仍有一定压力","上涨有限","仍存支撑","上涨持续性仍待观察","有反弹的概率","价格仍存支撑","下跌动能不足","短时超跌反弹","支撑仍在",
            "空单止盈","不宜过度追高","上行仍需等待驱动","震荡止跌","支撑依然在","短期将有所支撑","逢低多但不要追多","不具备趋势性上行动能","不必过度悲观","不轻言单边做空","继续下跌的空间有限","反弹力度有限","止跌回调","继续上行动能或将减弱",
           "限制价格回落","企稳筑底","等待布局多单机会","反弹将面临","估值支撑","多单逐渐获利离场","反弹力度减弱","不会一帆风顺","不建议继续追多","上方的空间也不会太大","反弹持谨慎态度","回升还需契机",
           "跌破成本尝试买入","需求弱势逐渐兑现","价格反弹力度较为有限","限制涨幅","存在底部支撑","涨幅受到限制","反弹幅度易受限","继续上行有阻力",
           "受到现货的制约","成本支撑尚在","多配对冲","多单逐步止盈立场","继续上行动力趋弱","难大涨","多单可以逢高减持","难明显回落","单边多头适当减仓","支撑有效性"]
point_neg_8 = ["近弱远强","顶部价格已现","顶部已现","反弹后抛空","逢高抛空","空单轻仓持有","维持下跌态势","做空远月合约",
                "短线空单参与","再次转弱","空单注意节奏","维持偏空思路","逢高轻仓试空","卖出套保头寸","趋势空单参与","再度杀跌"]
point_neg_7 = ["回落","逢高建仓空单","看空单边","弱势运行","易跌难涨","走势可能趋弱","期价仍被高估","下行过程中波动较大","负反馈进行","反弹后可介入空单","跟随美豆补跌","存在较强的上行压力","反弹布空","反弹后择机做空","空单滚动操作","反弹偏空","反弹后逢高做空","远月逢高空","氛围再度转悲","反弹做空","单建议设置止盈","回调","短期压力加剧","反弹逢高做空","压制近月价格","偏弱震荡","逢高试空","弱势震荡","或将探低","负反馈持续","保持看空",
               "跌势为主","维持下跌态势","多配","颓势难改","择机布空","领跌油脂","震荡偏弱运行","偏弱运行","运行重心或将下移","或继续向下","逢高布局各品种空单","空配位置",
               "继续探底","反弹压力位试空","下行风险犹存","利空有色金属","高空","利空依旧存在","较强上行压力","空单设好止盈","价格偏弱运行","价格仍有一定下行空间","宽幅震荡偏弱","关注高位布空机会","高位时布空机会"]
point_neg_5 = ["下行驱动逐渐放缓","下行风险仍存","小幅反弹","上方建立空单","偏弱局面继续震荡","等待反弹再空","难言止跌","获利减仓","逆势做多风险较大","空单注意获利减仓","利多出尽后的利空","对国内糖价构成压力","寻找合适的底部位","跌幅或将放缓","难言企稳","后期仍有承压","轻空","形成拖累","关注下行风险","难以有效实现企稳","供需预期转弱","抗跌可能将是短期","弱平衡","下跌空间不宜太悲观","难乐观","弱稳运行","寻找高位震荡区间下沿","中期压力仍在","空单分批止盈","逢高建立空单","不过于追空","空单谨慎","谨慎承压","偏空操作低位落袋","走势不乐观","难成反弹走势","有回调可能","供需双弱","压制期价上行","价格承压","弱于黄金","难有反弹","重心继续下移","难有支撑","关注能否向下突破",
                "上行空间也较为有限","观望或维持逢高短空","后期仍有走跌压力","轻仓做空","价格仍有下行空间","价格仍有一定下行空间","重心下移","下调风险","难有趋势性上涨行情","持续性压制","重心或有下移","先抑后扬","难长期维持在当前高位",
                "空单谨慎持有","不宜过分看跌","限制价格大回升","短空长多","谨慎悲观","贴水继续走弱","看空也会偏短暂","轻仓做空远月合约","施压", "压力未消退","压制乙二醇价格"]
point_neg_3 = ["短多止盈","反弹至高位再空","库存持续累积","上方仍然存在压力","下行空间或不大","回落空间或有限","相对抗跌","难以走入大熊市","反弹稍显乏力","不过度悲观","不追空","不建议大举追空","反弹无力","不是做空的最佳标的","反弹承压","追空需谨慎","短多或逢反弹减仓","无法驱动上涨行情","不建议持有多头","未见明显上行驱动","回调空间相对有限","继续下行空间不大","存在一定压力","下方空间不大","情绪降温","供给较需求偏强","调整深度不宜看得过深","高位调整压力","回调的幅度有限","空单逐步止盈","不具备连续大跌的基础","下跌空间也不大","持续下行的空间可能将相对有限","上行空间有限","空单逐步逢低离场","难有大幅下跌空间","上行压力加大","等待反弹更好价位","难以上行","上行动能不足","高位松动","难有向上驱动","逢低落袋","价格稳定偏弱","抑制盘面持续下行","空单可逐步平仓","不容乐观","跌势放缓","期价难大跌","抑制反弹空间","缺乏持续做多的逻辑支撑","缺乏上涨动力",
                "多单止盈","进一步深跌难度较大","盘面仍有调整压力","空单开始逐步止盈","下方空间亦有限","限制反弹动力"
                ,"压制上行空间","存在上行压力","多单离场","限制上行高度","限制上方空间","限制其上方空间","现阶段性回调","区间小幅调整","小幅调整","上行空间十分有限"]

import jieba


for i in low:
    jieba.add_word(i)
for i in high:
    jieba.add_word(i)
for i in to_continue:
    jieba.add_word(i)
for i in zero:
    jieba.add_word(i)
for i in point_8:
    jieba.add_word(i)
for i in point_7:
    jieba.add_word(i)
for i in point_5:
    jieba.add_word(i)
for i in point_3:
    jieba.add_word(i)
for i in point_neg_8:
    jieba.add_word(i)
for i in point_neg_7:
    jieba.add_word(i)
for i in point_neg_5:
    jieba.add_word(i)
for i in point_neg_3:
    jieba.add_word(i)


def simplify_sent(c):
    cut = jieba.cut(c)
    cut_list = []
    for i in cut:
        cut_list.append(i)
    cut_list.reverse()
    print(c)
    print(cut_list)
    if "不追空" in c or "不追多" in c:
        return "0"
    if "短线反弹" in c:
        return "0.7"
    for c in cut_list:
        continued = False
        for i in to_continue:
            if i == c:
                continued = True
                break
        if continued:
            continue
        for i in zero:
            if i == c:
                return "0"
        if "滚动操作" in c and "多单滚动操作" not in c and "空单滚动操作" not in c:
            return "0"
        if "持续震荡" in c and "持续震荡偏弱" not in c and "持续震荡偏强" not in c:
            return "0"
        for i in point_8:
            if i == c:
                return "0.8"
        for i in point_7:
            if i == c:
                return "0.7"
        for i in point_5:
            if i == c:
                return "0.5"
        for i in point_3:
            if i == c:
                return "0.3"
        for i in point_neg_8:
            if i == c:
                return "-0.8"
        for i in point_neg_7:
            if i == c:
                return "-0.7"
        for i in point_neg_5:
            if i == c:
                return "-0.5"
        for i in point_neg_3:
            if i == c:
                return "-0.3"
        for i in high:
            if i == c:
                return "1"
        for i in low:
            if i == c:
                return "-1"
    return "0"
