low = ["偏弱", "下滑", "弱势", "下行", "走弱", "做空", "偏空", "下跌", "试空", "短空", "空单操作", "偏弱","向下压力较大","空头思路","抛空为主","反弹抛空",
       "逐步布空","承压", "超涨", "沽空", "回吐", "逢高空", "下破", "跳水", "弱调整", "弱趋势", "冲低", "上冲", "赶底", "走低", "大跌", "布局空单", "持空","下调",
       "高抛","空单继续持有","回调整理","空单持有","鹰派信号","压制铜价","持续偏弱","关注做空机会","逢高空","震荡趋弱"]
high = ["偏强", "上涨", "走强", "偏多", "做多", "试多", "上行", "乐观", "强势", "走强", "提振", "坚挺","探底回升","企稳反弹"
        "反弹", "回升", "短多", "多单操作", "超跌", "沽多", "逢低多", "上破", "强调整", "冲高", "下冲", "赶顶", "走高", "大涨", "布局多单", "持多","逢低多",
        "上调","多单继续持有","多单背靠","谨慎看多","逢低增持","双向回归","期价反弹","触底反弹", "继续反弹","向上修复","减仓反弹","底部反弹","支撑较强","逢低买入","多头思路","价格反弹","历史新高","关注做多机会"]
fluc = ["观望", "不宜", "上行承压", "上行乏力", "震荡对待", "先扬后抑", "短期反弹,趋势偏弱", "下行驱动逐渐放缓",
        "反弹难持续", "上行空间受限", "暂无利好", "高位震荡", "盘面震荡", "反弹空间有限", "多单谨慎持有", "空单谨慎持有",
        "反弹幅度已经较高", "低点支撑", "反弹难持续", "涨势趋缓", "跟涨情绪减弱", "近强远弱", "近弱远强", "止跌", "弱平衡", "阶段性震荡", "震荡中",
        "下行空间受限","上行空间有限","下行空间有限","底部价格已现","顶部已现","底部已现","顶部价格已现","反弹后抛空","逢高抛空","多单止盈",
        "不宜过分看跌","空单止盈","短线持多","短多看待","底部空间或将有限",'空单轻仓持有','多单轻仓持有',"短期内震荡行情","呈现震荡格局","仍较抗跌",
        "震荡走势为主","反弹幅度有限","震荡整理","限制价格回升","短多长空","短空长多","不宜过分看跌","不宜过分看多","反复震荡","不过于追空","不过与追多",'高升水',
        "宽幅震荡运行","横盘震荡为主","低位宽幅震荡","多头谨慎持有","才可能企稳回升","才可能企稳","震荡为主","后期主要关注","仍有反复","上行阻力依然较大",
        "维持区间震荡","交割因素扰动","不建议空单操作", "不建议多单操作","需要重点关注","锁定利润","被动涨势","产生支撑","旺季不旺","缺乏后劲","小幅整理","上行告一段落",
        "下行告一段落","反弹谨慎","反弹偏谨慎","风险尚存","谨慎乐观", "谨慎悲观","修复回补","震荡运行","高位震荡","低位震荡","小幅走强","需求回暖","上行有限","下行有限","小幅反弹",
        "空单谨慎","多单谨慎","短线多单参与","短线空单参与","买近抛远","多看少动","不做方向性预期","窄幅震荡","多EG","谨慎追涨","回调幅度有限","上涨驱动弱","暂时观望",
        "不宜追多","难言乐观","谨慎承压","短线炒作","短线震荡","支撑尚存","有回调可能","压制期价上行","横盘整理","延续振荡","延续震荡表现","高位区间震荡","上方空间有限","上行驱动不足",
        "维持震荡走势","短空止盈","短多止盈","上行动力不足","仍难打破震荡形态","等待企稳","高位调整压力","偏涨看待","高抛低吸","价格承压","短线交易为主","维持偏空思路","建议暂观望","议做多裂解价差",
        "加工差承压","开工下滑","整体震荡","难提振","多单逢高减仓","单边头寸谨慎","炒作未止","中期看空","单边观望","回落","回调","做空驱动不足","等待机会做空","价格震荡","偏强震荡",
        "反弹行情阶段性结束","限制价格回落","上行压力加大","继续回调","上行动能不足","易涨难跌","有支撑","轻仓过节","减仓交易","高位反复","延续高位运行","仍偏强","多单轻仓","空仓","仍有上冲基础",
        "震荡行情将延续","结构性反弹","中长期多头配置","保持强势运行","谨慎追多","FU偏强","跟随原油为主","震荡思路操作","形成托底","偏空对待","逢高止盈","空头持有","偏弱震荡","有一定反复","跟随油价震荡",
        "回归整理区间","贵金属波动加大","滚动操作","油价压力","多单少量参与","油粕比空单","支撑盘面","利多","下跌之后反弹","基差回落","多单滚动操作","短多交易为主","持有前期多单","空单可部分止盈",
        "短线操作为宜","重归反弹","未透露更多鹰派信号","短线交易","逢低做多","震荡走势","跟随油价波动","继续向上","向上突破","轻多尝试","反弹强度不及","短线操作", "难有向上驱动","建议观望为主","等待价格企稳",
        "产量回升","价差有望走强","向上空间或有限","短线多单","逢高轻仓试空","缺乏基本面驱动","宽幅运行","长线偏空","谨慎操作", "不建议虚盘操作","防范价格下跌风险","价格中枢上移"
        ,"短期中性","继续破新高","不宜过度追高","尚未出现短缺","建议轻仓操作","高点很难预估","回调买入","下行空间或有限","压制上行空间","中性为主","价差有望走强","难以大幅走高"
        ,"维持震荡趋势","盘面看震荡","区间操作","震荡思路对待","轻仓做空","卖出套保头寸","止跌回涨","上行空间也较为有限","出现反复","下方空间有限","强现实弱","继续调整","谨慎对待","短期压力加剧",
        "多单离场","逢低试多","定投方式参与","利润向上修复","持续震荡","回调的风险","两难境地","震荡止跌","重心上移","重心下移","供需偏紧","下调风险","较强支撑","持续上涨动能不足"]



import jieba


for i in low:
    jieba.add_word(i)
for i in high:
    jieba.add_word(i)
for i in fluc:
    jieba.add_word(i)
def simplify_sent(c):
    cut = jieba.cut(c)
    cut_list = []
    for i in cut:
        cut_list.append(i)
    cut_list.reverse()
    for c in cut_list:
        if "才可能企稳回升" in c or "才可能企稳" in c or "议做多裂解价差" in c or "加工差承压" in c or "开工下滑" in c or "难提振" in c or "FU偏强" in c or "油价压力" in c\
                or "油粕比空单" in c or "基差回落" in c or "未透露更多鹰派信号" in c or "风险" == c or "等待价格企稳" in c or "产量回升" in c or "价差有望走强" in c\
                or "防范价格下跌风险" in c or "价差有望走强" in c or "难以大幅走高" in c or "短线的回落" in c or "回调的风险" in c:
                continue
        if "震荡对待" in c or "上行空间受限" in c or "下行空间受限" in c or "波动风险加大" in c \
                or "震荡为主" in c or "高位震荡" in c or "盘面震荡" in c or "反弹空间有限" in c or "反弹幅度已经较高" in c \
                or "反弹难持续" in c or "跟涨情绪减弱" in c or "阶段性震荡" in c or "震荡中" in c or "上行空间有限" in c or "下行空间有限" in c or \
                "底部空间或将有限" in c or "短期内震荡行情" in c or "呈现震荡格局" in c or "震荡走势为主" in c or "震荡整理" in c or "反复震荡" in c \
                or "宽幅震荡运行" in c or "横盘震荡为主" in c or "低位宽幅震荡" in c or "震荡为主" in c or "后期主要关注" in c or "仍有反复" in c or \
                "上行阻力依然较大" in c or "维持区间震荡" in c or "交割因素扰动" in c or "不建议空单操作" in c or "不建议多单操作" in c or \
                "需要重点关注" in c or "锁定利润" in c or "旺季不旺" in c or "缺乏后劲" in c or "小幅整理" in c or "上行告一段落" in c or \
                "下行告一段落" in c or "风险尚存" in c or "震荡运行" in c or "高位震荡" in c or "低位震荡" in c or "上行有限" in c or "下行有限" in c\
                or "多看少动" in c or "不做方向性预期" in c or "窄幅震荡" in c or "上涨驱动弱" in c or "暂时观望" in c or "难言乐观" in c or "短线震荡" in c\
                or "横盘整理" in c or "延续振荡" in c or "延续震荡表现" in c or "高位区间震荡" in c or "上行驱动不足" in c or "维持震荡走势" in c or "上行动力不足" in c\
                or "仍难打破震荡形态" in c or "等待企稳" in c or "高抛低吸" in c or "短线交易为主" in c or "建议暂观望" in c or "整体震荡" in c or "多单逢高减仓" in c or "单边头寸谨慎"\
                in c or "单边观望" in c or "做空驱动不足" in c or "价格震荡" in c or "反弹行情阶段性结束" in c or "轻仓过节" in c or "减仓交易" in c\
                or "高位反复" in c or "空仓" in c or "震荡行情将延续" in c or "跟随原油为主" in c or "震荡思路操作" in c or "逢高止盈" in c or "有一定反复" in c or "跟随油价震荡" in c\
                or "回归整理区间" in c or "贵金属波动加大" in c or "空单可部分止盈" in c or "短线操作为宜" in c or "短线交易" in c or "震荡走势" in c or "跟随油价波动" in c or "短线操作" in c\
                or "建议观望为主" in c or "向上空间或有限" in c or "缺乏基本面驱动" in c or "宽幅运行" in c or "谨慎操作" in c or "不建议虚盘操作" in c or "短期中性" in c\
                or "尚未出现短缺" in c or "建议轻仓操作" in c or "高点很难预估" in c or "下行空间或有限" in c or "中性为主" in c or "维持震荡趋势" in c or "震荡思路对待" in c\
                or "谨慎对待" in c or "定投方式参与" in c or "两难境地" in c or "继续调整" in c or "下方空间有限" in c or "强现实弱" in c or "出现反复" in c or "盘面看震荡" in c \
                or "区间操作" in c or "持续上涨动能不足" in c:
            return "0"
        if "滚动操作" in c and "多单滚动操作" not in c and "空单滚动操作" not in c:
            return "0"
        if "持续震荡" in c and "持续震荡偏弱" not in c and "持续震荡偏强" not in c:
            return "0"
        if "短期反弹,趋势偏弱" in c or "先扬后抑" in c or "近强远弱" in c or "底部价格已现" in c or "底部已现" in c or "短线持多" in c \
                or "短多看待" in c or '多单轻仓持有' in c or "产生支撑" in c or "修复回补" in c or "小幅走强" in c or "需求回暖" in c \
                or "小幅反弹" in c or "短线多单参与" in c or "限制价格回落" in c or "仍有上冲基础" in c or "结构性反弹" in c or "保持强势运行" in c \
                or "利多" in c or "短线多单" in c or "价格中枢上移" in c or "利润向上修复" in c or "较强支撑" in c:
            return '0.8'
        if "布局多单" in c or "偏强震荡" in c or "重归反弹" in c or "继续向上" in c or "向上突破" in c or "破新高" in c:
            return "1"
        if "短多止盈" in c or "高位调整压力" in c or "上行压力加大" in c or "上行动能不足" in c or "难有向上驱动" in c\
                or "多单止盈" in c or "压制上行空间" in c or "多单离场" in c:
            return "-0.3"
        if "买近抛远" in c or "短空止盈" in c or "高位运行" in c or "有支撑" in c or "延续高位运行" in c or "下跌之后反弹" in c\
                or "空单止盈" in c or "不宜过度追高" in c or "震荡止跌" in c:
            return "0.3"
        if "反弹难持续" in c or "布局空单" in c or "空头持有" in c or "偏弱震荡" in c:
            return "-1"
        if "近弱远强" in c or "顶部价格已现" in c or "顶部已现" in c or "反弹后抛空" in c or "逢高抛空" in c or '空单轻仓持有' in c\
                or "短线空单参与" in c or "维持偏空思路" in c or "逢高轻仓试空" in c or "卖出套保头寸" in c:
            return "-0.8"
        if "下行驱动逐渐放缓" in c or "弱平衡" in c or "不过于追空" in c or "空单谨慎" in c or "谨慎承压" in c or "有回调可能" in c or "压制期价上行" in c or "价格承压" in c \
                or "中期看空" in c or "等待机会做空" in c or "继续回调" in c or "偏空对待" in c or "长线偏空" in c or \
                "上行空间也较为有限" in c or "轻仓做空" in c or "重心下移" in c or "下调风险" in c:
            return '-0.5'
        if "多单谨慎持有" in c or "低点支撑" in c or "涨势趋缓" in c or "仍较抗跌" in c or "反弹幅度有限" in c or "短多长空" in \
                c or "不宜过分看多" in c or "不过于追多" in c or "被动涨势" in c or "反弹谨慎" in c or "反弹偏谨慎" in c or "谨慎乐观" in c or "多单谨慎" in c \
                or "多EG" in c or "谨慎追涨" in c or "回调幅度有限" in c or "不宜追多" in c or "短线炒作" in c or "支撑尚存" in c or "上方空间有限" in c or "炒作未止"\
                in c or "易涨难跌" in c or "仍偏强" in c or "多单轻仓" in c or "谨慎追多" in c or "形成托底" in c or "多单少量参与" in c or "支撑盘面" in c or "多单滚动操作" in c or \
                "持有前期多单" in c or "轻多尝试" in c or "反弹强度不及" in c or "回调买入" in c or "重心上移" in c:
            return '0.5'
        if "多头谨慎持有" in c or "偏涨看待" in c or "中长期多头配置" in c or "短多交易为主" in c or "逢低做多" in c or \
                "逢低试多" in c or "供需偏紧" in c:
                return '0.7'
        if "空单谨慎持有" in c or "不宜过分看跌" in c or "限制价格回升" in c or "短空长多" in c or "谨慎悲观" in c \
                or "贴水继续走弱" in c:
            return '-0.5'
        if "回落" in c or "回调" in c or "短期压力加剧" in c:
            return '-0.7'
        if "止跌回涨" in c:
            return '0.8'

        if "反弹难持续" in c:
            for i in low:
                if i in c:
                    return "-1"
        if "多TA" in c:
            return "1"
        for i in fluc:
            if i in c:
                return "0"
        for i in high:
            if i in c:
                return "1"
        for i in low:
            if i in c:
                return "-1"
    return "0"