import chatgpt_test
import test

low = ["反弹难持续","布局空单","空头持有","偏弱震荡","偏弱", "下滑", "弱势", "下行", "走弱", "做空", "偏空", "下跌", "试空", "短空", "空单操作", "偏弱","向下压力较大","空头思路","抛空为主","反弹抛空",
       "逐步布空","承压", "超涨", "沽空", "回吐", "下破", "跳水", "弱调整", "弱趋势", "冲低", "止损上冲", "赶底", "走低", "大跌", "布局空单", "持空","下调",
       "高抛","反弹空","继续下挫","继续受挫","下挫","进一步下挫","施压","空单继续持有","偏弱运行","回调整理","空单持有","鹰派信号","压制铜价","持续偏弱","关注做空机会","逢高空","震荡趋弱"]
high = ["布局多单","偏强震荡","重归反弹","继续向上","向上突破","破新高","多TA", "偏强", "上涨", "偏多", "做多", "试多", "上行", "乐观", "强势", "走强", "提振", "坚挺","探底回升","企稳反弹","存在反弹机会",
        "反弹", "回升", "短多", "多单操作", "沽多", "上破", "强调整", "冲高", "下冲", "赶顶", "走高", "大涨", "布局多单", "持多","逢低多", "反弹修复","多单参与","多单参与为主","以超跌做多",
        "上调","多单继续持有","多单背靠","谨慎看多","逢低增持","双向回归","期价反弹","触底反弹", "继续反弹","向上修震荡向上复","减仓反弹","底部反弹","支撑较强","逢低买入","多头思路","价格反弹","历史新高",\
        "关注做多机会","利好短期价格","多单可以继续持有","多单持有","继续爬升","利润持续修复"]
to_continue = ["才可能企稳回升","利润预计承压回落","中线煤价偏弱预期","规模却在继续下滑","月差依旧承压","炉料价格意外大幅度上升","风险中炉料价格上涨","期权方面可买入","价差上方仍承压","如品种涨跌幅超过","逢高做空苯乙烯加工费","木材期货价格上涨","环比走强","能否上涨还需关注","中期维持多头","中长线偏空","风险是原油继续下跌","才可能企稳","开工率回升","警惕盘面情绪回落及原油下跌等外围因素带来的负面影响","中线低位区间震荡","警惕情绪平静后的回落风险","基差快速回落","中长期仍应逢高布空","供应有所下滑","价格下跌风险","偏多和煤价大幅下跌","承压对纯碱","偏多9","长期维持逢高沽空","中期或震荡偏弱","做多裂解价差","加工差承压","需求超预期回升","果价格大幅下滑","反弹需现货","开工下滑","难提振","风险原油继续下跌","供需预期仍偏弱",
               "做多螺矿比","不过原油大跌","不轻易尝试做空","91反弹","长期偏空","企稳回升仍需","长期仍有上涨做多","长期策略仍建议逢高沽空","长期看空","中长期仍偏空对待","长线等待逢低做多","中长期看铝价仍有下行空间","正套可择机止盈","内外比值回升","情绪降温后","供应回升","裂解多头介入","关注疫情控制及需求回暖情况","价格是否下行","中期能否上涨","可做多螺矿比","注意原油反弹","等待回调低位做多利润","FU偏强","油价压力","回调风险逐步降低","积极性回升","下跌主要来自","产能回升的压力",
                "油粕比空单","炉料价格意外大幅度上升","基差回落","逢高参与反套","未透露更多鹰派信号","加工费承压","做多淀粉-","反弹压力下移","需求季节性下滑","中期依然偏弱","中期关注反弹后抛空","买入期权","中期偏空","做多波动率","中线关注反弹后做空","中期供需预期偏弱市场承压","应注意共振上涨","中期供需偏弱市场承压","等待价格企稳","产销回落","产量回升","风险在于成本端煤炭价格的下行","基差有所反弹","价差有望走强","乳胶水高位回落","在价格上涨时","基差走弱","比值或将走强","做多短纤与","随着原料下跌",
               "胀预期回落","810短线操作","仓单持续下滑","外盘下跌","中长期逢高做空","月差继续偏强","逢高做空波动率","合约强势","上涨的兑现以后","中期还是偏空","做空PDH利润","逢高空豆油基差","中期维持偏空思路","中长期仍维持震荡偏空","回落后的滞涨甚至回调风险","跨期结构上有望持续保持强势","若成品油价格回落则将带动原油走低","库存回升情况","受棕油回落影响","注意过度下跌后的反弹","做多硅锰空硅铁套",
               "警惕回落风险","逢低布局月间","做多产业利润","逢低做多远月利润","高抛低买","交易量较节前有所回落","基差近日反弹","中期偏弱","锰矿超预期上涨","关注反弹","中长期仍然看空硅铁价格","基差走强","期货价格回调风险","正套仍会偏强","现货回落幅度较小","原油回落时","买入期权进行风险管理","中线关注反弹后做空","中期看上方仍存空间","中期逢高抛空","原油下挫风险","逢低做多9-","套保空单可逢高介入","注意原油回落","盘面回调后","下行风险为","风险是原油反弹","反弹关注上方","煤炭价格继续上涨","逢低做多MTO利润","价差有所反弹","反套可止盈离场",
               "极性回升","不锈钢价格的上涨","基差或继续下行","期权方面考虑买入SI","买入PTA卖出PX","在油价反弹期间","下跌后","比价继续大幅下行","警惕价格高位回落","原油价格大幅反弹","量仍有上调空间","价差修复走高","消费提前走弱","套利逢低介入","中期趋势偏弱","现货承压","中期仍有下行风险","供需预期双双下调","继续上行有待","中期仍偏弱","加工费继续走强","价差则是相对偏强","原油端继续下行","做空的盈亏比不佳","后期或有继续回升可能","中线偏空","糖醇比价继续走高","等待利多的基本面","中期需关注逢高做空","库存边际下行","中长期等待反弹做空",
               "浮法弱势压制","面对反弹也需保持谨","正套逐步止盈","期权方面考虑买入","下破14500离场","升水上涨","反弹带来","做多钢厂利润","关注现货回落节点","结合油价下跌","逢低做多短纤与","谨防随时承压回落","月底交割之后市场情绪回落","上行空间一是",
               "产业客户等待回落","边际驱动走强+估值高","月差偏强","保证金上调","中长期逢高做空","做空波动率","做多05油粕比","做多焦化利润","套利:观望","中长线PTA依旧偏弱","3MA逢低做多","中期在下游需求弱势与供应回归下将维持震荡偏弱","警惕玻璃价格下行等","做空月间价差","海外需求走弱下","中期维持逢高做空思路","价差有所走强","持仓能否继续回升","回归基本面主导","中长期仍然看空","风险是原油继续震荡偏弱","中期做空","长期依旧建议逢高沽空","等待1月猪价重回24000元区间高位的做空机会","做空PTA加工费","金银比如预期回落","以防价格下跌带来的风险","卖出虚值","等待四季度低位布多","价差或会走低","长线维持看多",
               "中期维持偏空思路","月间价差有走弱可能","中期维持偏多","做多波动率","做多沥青裂解","1-5做空机会","中期维持逢高做空","持仓进一步走低","开工率重新回升","长期等待反弹抛空","附近压力","中期趋势仍偏弱","做多金银比","套利:观望","警惕盘面价格快速回升","后期等待需求改善",
                "防范价格下跌风险","反弹压力参考","到港偏多","逢高做空PTA加工差","做多5-9价差","做阔波动率","螺矿比多单","下破14400离场","电费水平是否下调","等待政策提振","上涨持续性信心不足","原油下跌","价差走强","长期以反弹布局","关注需求下滑程度","月差进一步扩大","差逢高止盈","做空PDH利润","基差偏强","需警惕回调风险","CONAB下调","长期双硅逢高偏空","中期小幅乐观","中长期仍维持偏空","出现明显走低","库存上升","原油大跌","价差多单","偏强的基差","基差的走强","观察周末反弹的持续性","价差有望走强","难以大幅走高","做多油粕比","关注现货反弹","短线的回落","中长期偏空","回调的风险","加工费回调空间有限","利润持续走低","逢低做多短纤与 PTA 价差","警惕期价连日上行后的回调风险"]
zero = ["震荡对待","暂时保持区间","冲高动力不足","波动或加大","观察反弹高度","但后续空间较为有限","继续下行动能不足","逢低做多PTA加工费","驱动尚且不足","上下压力均大","空头可以暂时退场","不支持铅进一步走高","空弹节前止盈","单边短线操作","短线思路为主","缺乏上行驱动","区间看待","金价短期企稳","上行有制约作用","将维持高位","有一定的调整风险","难以走出大方向","注意持仓风险","不建议盲目做空","将维持相对高位","顶部压力偏强","走势反复","逐渐转向谨慎","流动性收缩","受到资金面的影响依然较大","做缩高低硫价差","持仓量较大带来的风险","追高意愿不足","回调空间或有限","多单逐渐离场","涨势预期难持续","多单可以考虑获利平仓","持续上行空间相对有限","波动将加剧","上行空间受限","上涨基础不牢固","正套交易","反弹而非反转","下方空间相对有限","反应可能不会那么大","资金变化情况","预计围绕","有支撑","制约上涨","难有突破上涨","限制锡价上行空间","仍需观察","较大压力","震荡","无大幅上涨驱动","上行空间有限","不会持续下跌","限制港口现货下行","等待交易机会","趋势性暂不明朗","下跌空间受限","多头离场避险","缺乏持续下行驱动","高位持稳","或缺乏冲高动能","缺少上涨动能","反弹高度不宜乐观","限制镍价回升","中长期仍偏空对待","不会保持过高或过低","能否有效站稳","不要过分期待","多头止盈","进一步上行的空间不大","稳为主","谨慎为佳","回升还需契机","难以给出就此反转上涨","警惕价格冲高回落",
        "之上表现","价格维稳","短空09和回落买入11","乏力上行","短期谨慎","波段思路","不建议在此位置追空","做空风险大","继续等待进一步信号","上涨有压力","上涨受限","进一步上行阻力较大","才是工业硅价格真正开启反弹","单边交易仍需谨慎","等待触顶信号","短期维稳","建议短线操作","不建议做单边","减仓操作","难以继续上涨","短期看震荡","下旬可考虑逢高沽空","快速走弱的概率较低","多单宜止盈","追多不是性价比","落袋","转向震荡","窄幅波动","不建议追多","短期节奏较难把握","风险在于煤炭与原油价格的下行",
                "操作短线为宜","上方仍有压力","不建议提前布空","短期波动为主","空单暂时离场","行情变化不大","振幅将加剧","存在多头撤退的可能","难以有明显的走弱","继续下探空间不大","持谨慎态度","注意回调风险","继续大幅下跌空间或相对有限","不利于短期价格的继续下跌","波动风险犹存","有所反复","限制价格反弹","区间震荡","不建议抢反弹","止盈减仓","多空拉锯","有望暂时出尽","反弹是否出现","盈亏比并不高","日内为主","反弹受阻","区间运行","整理走势为主","结束反弹离场","趋稳运行","做多情绪不强","单边日内交易","基差上涨","不建议参与","价格主要受成本端影响","未见上行驱动",
                "继续跟随油价运行","关注橡胶何时见顶","多单可阶段性离场","不支撑价格持续上行","逐步止盈","继续拉涨的空间或将将较为有限","附近试探","严格止损","不宜追高","盘面整理运行","不利于金价上涨","建议规避风险","不确定性较强","谨慎为宜","单边参与性难度加大","等待机会","动能仍显不足","上涨难度大","对下行风险保持警惕","上涨空间受阻","上涨动力受阻","底部位置的博弈","展开震荡","继续冲高动力不足","保有谨慎态度","区间内操作","反弹拐点延后","震荡态势","具备维持高位","无较强利多支撑","难以打开高度想象","走势偏震荡","振幅缩窄","短多暂时离场","持续高基差运行","维持较为谨慎","下行空间受限","区域震荡","波动风险加大","震荡为主","高位震荡","关注上方压力与下方支撑","盘面震荡","反弹空间有限","反弹幅度已经较高","多TA空EG","价格承压阶段性","价格进入调整阶段",
                "反弹难持续","待本轮上行驱动消化后转向弱势","推荐回避","冲高但上方承压","空单建议离场","整体价格存支撑","宽幅整理运行","等待回调后做多","面交织","谨慎回调风险","投机氛围将明显下降","一线徘徊","下跌或遇到抵抗","沪锡主力合约参考运行区间","缓解高压库存的良机","仍需磨底","单边参与难度加大","上涨驱动转弱","多看少碰","跟涨情绪减弱","缺乏上涨动能","追空的风险","静待","短线为主","短期调整","难持续上涨","警惕高位追多风险","等待商品整体方向","震荡延续","难实质性反弹","空单注意减仓","建议止盈","看跌期权剩余多单离场","关注5600争夺","区间表现","反弹行情宣告结束","反弹空间也将受限","偏稳整理","低吸高抛","跌破上行趋势还需观察","未进者等待","不宜高看","回调有限","调整空间或受限","不追高","趋于中性","不留单边多头","振荡运行","获利减仓","缺乏行情动力","不推荐追多","长线需关注逢高做空","冲高或面临压力",
                "部分止盈","上涨持续性欠缺","难有持续上行动力","反弹略显乏力","现货小幅下跌","谨防随时掉头","随时面临阶段性调整","多单回避","单边波动风险太大","日内交易为好","难有持续上涨的动力","反弹缺乏需求","维持1500-1600震荡","大概率是反弹的顶部","交易市场情绪","单边暂不推荐","等待做空机会","大幅波动风险","风险加剧","形成震荡","现货价格稳步下滑","可获利了结","大方向跟随钢材","短线参与","不建议追空","基本面无明显驱动","暂不构成下行趋势","高抛低平","下挫或告一段落",
                "阶段性震荡","难以获得持续上行驱动","不建议逆势做多","深跌动能不足","反弹的空间已经不多","不建议低位继续追空","平稳对待","不建议赌单边","做多有风险","风险较高","短期没有趋势","短期不建议做多","多头撤退的可能","做多热情高位退却","下方支撑考虑较为坚固","回调空间预计有限","区间整理","面临大幅波动","注意止盈","谨慎参与","反弹持续性受限","整理格局","暂不过分看空","关注当下产区生产供应变化","暂无趋势","调整为主","价格调整为主","低多高空","震荡中","暂不做判断","仍难有强势表现","成本端的影响较大","附近震荡","难有上涨动力","价格趋稳运行",
                "底部空间或将有限","短期关注终端限电影响","下行或有限","剩余空单获利离场","难有明显上涨趋势","平稳运行","单边价格预计中性","给予硅价向上压力","暂时缺乏上行动力","上边际看不到太高","价格中性","压制上方空间","横盘胶着整理","上方空间不大","限制未来猪价的上行空间","不具备做多价值","带来不确定性","区间整理走势","区间整理对待","建议做好资金管理和风控","难以大幅下跌","向上空间同样不足","缺乏持续上冲动力","上涨行情难免一日游","持续上涨的可能性较低","中长期逢高抛空","留意01上方压力","一线争夺","上方空间受限","振荡思路","开盘可先观察","下方空间或有限","不应该太过悲观","很难拔地而起","不宜过度悲观","建议谨慎","低买高平","跟随成材波动","难以有实质性上涨",
                "低吸高平","不建议追涨杀跌","以宽幅震","短期偏谨慎","上涨空间受限","进一步上行存在阻力","单边空间较为有限","空单规避","震荡行情","上行驱动弱","跟随原糖摆动","受宏观面因素波动","缺乏驱动","跟随原油","震荡看待","难言转势","处于震荡","短期内震荡行情","做多下游利润","短期震荡思路","不宜追空","值得关注","呈现震荡格局","仍是震荡市","震荡走势为主","震荡整理","反复震荡","观望","宽幅震荡","走势震荡","受原料端影响较大","维持震荡策略","震荡思路","不建议继续追多",
                "宽幅震荡运行","暂不过分悲观","单边短线思路","持续向下的空间较小","策略上保持谨慎","难以出现大幅下挫","缺乏足够动力进一步上行","建议暂时","供需矛盾有所减弱","上方仍有空间","没必要高位去追","维持中性预期","不用试图逢高沽空","向下空间不大","需进一步观察触及","难以形成趋势性走势","横盘震荡为主","仍有支撑","预期摆动","等待布空的机会","区间对待","及时离场","趋向于震荡","区间行情对待","反弹告一段落","上行压力不断加大","多头或止盈离场","短暂波动调整","期货价格震荡","警惕回落风险","反弹驱动不强","适当止盈","有整理需求","做多存较大风险","短期震荡","不建议投资者继续追空","跟随原油震荡","不宜追多","较大不确定性","多空博弈加剧","两粕菜油关注","震荡操作","日内短线","低位宽幅震荡","震荡为主","仍有反复","空头止盈离场","跌幅大小","一线上下震荡","价格跟随原料","基本面变化不大","震荡一段时间","维持高位盘整","等待市场企稳","提振效果不大",
                "上行阻力依然较大","不易追多","不建议入场","持续下行的空间预计有限","上下游价格博弈","轻仓过节","留意下方60均线","不宜追高参与","短期偏中性","反复筑底","区间走势","情绪有所缓解","维持观望","抑制铜价上行空间","上下有限","建议观望为主","盘整观望","震荡前行","易反复振荡","震荡概率较高","警惕情绪回落风险","底部存支撑","上涨动能不足","以震荡的思路","难以持续冲高","波动较为剧烈","窄幅调整","继续上涨动能受限","反弹后回落风险","存在大幅波动风险","能否形成有效支撑","制约着盘面的反弹空间","向上驱动不足","维持区间震荡","供需矛盾相对不大","交割因素扰动","不会再扩大跌幅","不建议空单操作","不建议多单操作","继续观望","反弹不可延续","震荡筑底","PX继续强势","维持震荡调整","逐渐企稳的概率较大",
                "锁定利润","提振力度不大","逐步磨底","难以持续下跌","旺季不旺","上行压力渐大","空头思路尾声","暂无明显反弹驱动","追空意义不大","低位整理","限制价格回调空间","无突破行情","看涨期权建议减持","反弹的动力不足","基本面的交易价值并不大","追多风险偏大","区间振荡为主","做小价差","僵持整理","期价震荡","暂不会趋势下跌","反弹的持续性存疑","推荐轻仓交易","短期注意规避风险","关注需求能否","回落受限","多头平仓","能否反弹还需观察","延续僵持","震荡消化节后随外盘快速上涨走势","跟随成材为主","阶段性博弈","上方存在压力","阶段性回调的风险","横盘窄幅波动","空单出场","展开争夺","会更抗跌","缺乏后劲","小幅整理","上行告一段落","或压制挤仓风险","不宜做空","反弹不可持续","日内短线参与","建议观望","反弹空间受限","警惕高位风险","限制远月合约上方空间",
                "下行告一段落","显著问题的才能做空","不具备追空价值","压制镍价上行空间","策略上趋于谨慎","高位逐步止盈","策略上偏谨慎","反弹遇阻","下方空间依然关注","风险尚存","谨慎入场","关注下方支撑","市场分歧仍存","反弹或接近尾声","强势格局难持续","驱动有限","是否有效跌破","价格暂稳","单边做空难度偏大","低位波动","偏稳运行","反弹难以持续","有所止盈","方向性并不强","抑制铁矿上涨的高度","波动运行","看涨期权做保护","多单可止盈","难持续反弹","抗跌运行","冲高乏力","波段交易","缺乏进一步上涨动力","浮法日熔下滑","跟随油价运行",
                "跟随原料运行","注意价格反向波动","供需两弱","难以支撑持续反弹","以震荡为主","跌幅受限","多单获利了结","跟随估值波动","上下空间都不大","附近做震荡","无明显反弹动能","难以走出趋势性行情","动或加剧","小幅震荡","震荡运行","低位震荡","上行有限","下行有限","暂时观望","缺乏明显的供需矛盾","不建议做虚盘","反弹空间或有限","寻找平衡","关注终端恢复节奏","限制贵金属上行动力",
                "多看少动","难以继续向上突破","出现跌幅趋缓或反弹","上涨仍受约束","有止盈离场趋势","反弹动力不足","反弹受限","短期滚动交易","上方空间或相对有限","关口得失情况","窄幅横盘","反弹到高点再空","拐点已临近","上涨或下跌概率均不大","短期不确定性","制约涨幅","单边交易难度较大","关注能否突破","后期待反弹做空","胶着状态","驱动力不强","下方空间恐怕是有限","潜龙在渊","库存下降","不宜空配","库存增加","继续被动跟随原料","不做方向性预期","年内仍有机会上涨","并非有利上涨","上行受限","窄幅震荡","附近徘徊","上涨驱动弱","暂时观望","难言乐观","抑制期货盘面持续下行的空间","短线震荡","表现震荡","上涨空间有限","下行趋势或可缓和","高位振荡运行",
                "建议观望","维持稳定","上行难度较大","进入横盘振荡","仍对油价形成扰动","呈现高波动状态","警惕回调风险","日内交易为主","低位反复","逐渐转为谨慎","较难持续上涨","震荡趋势还将延续","等待新的指引","利空有所消化","单边操作日内","上下两难的境地","涨跌两难","空单也可以适当减仓止盈","反弹高度暂不过于乐观","近强远弱","主力区间","方向跟随成材","等待驱动明朗","不看大跌","单边震荡","压力表现","原油下行预期","关注周六","不建议单边操作","偏震荡","多空均有故事可讲","限制反弹高度","维持震荡","波动趋势运行","延续震荡","上行动力依旧不足","盘面抗跌","调整空间有限","被动跟随原料波动",
                "横盘整理","延续振荡","轻仓短线","上行阻力加大","回调空间受限","缺乏支撑价格持续上行","平台支撑","再次选择方向","难撑价格大涨","耐心等待","等待方向选择","上方空间较为有限","随油脂板块走势","有支撑亦有阻力","进一步下跌需要看到","前多平仓","下行空间也将受限","多配的空间不大","上涨动力不足","反弹将受到明显制约","需进一步验证","做好止盈","等待后续继续做空","逆势做多风险较大","报告前继续关注","多单减仓止盈","前期多单建议逐步","上方空间有限","不建议单边追涨","阶段性见顶","玉米震荡","反弹之后还将继续下堕","短期可能处于震荡","短期或存在一定超跌","反弹乏力","震荡反复","延续震荡表现",
                "宽幅波动为主","上行压力逐步凸显","，短线思路","难有进一步抬高","没必要强行参与","压制盘面上行空间","高位区间震荡","短期见顶","上行驱动不足","上行动力有限","以套利为主","维持震荡走势","上行动力不足","方向不清晰","区间震荡","做多钢厂利润","难有大跌","随成本端继续震荡","震荡调整","面临方向选择",
                "仍难打破震荡形态","不支持铜价在","反弹高度受限","受原油波动影响较大","偏多策略暂停","将区间运行","持续性有待观望","等待企稳","谨慎交易","推涨较难持续","单边的风险仍旧较大","继续突破前高的难度较大","缺乏持续下行的驱动","反弹行情告一段落","能否企稳反弹mao","幅度有限","转关注","跟随成本运行","观望为主","反弹程度有限","反弹才具有可持续性","滚动操作","高抛低吸","需要观察","短线交易为主","操作上建议保持谨慎","上行的驱动略显不足","建议暂观望","整体震荡","多单逢高减仓","在高位纠结","单边头寸谨慎","不会大跌","等待明朗","日内操作为宜","进入高位盘整走势",
                "单边观望","做空驱动不足","下行驱动不足","反弹或难以持续","中性看待","上行或受限","限制铜价上升空间","整体驱动不足","下行空间是有限的","单边日内为主","一线博弈","价格震荡","重回震荡","跟随宏观震荡","不温不火","调整空间或有限","反弹行情阶段性结束","限制01合约下方空间","关注宏观风险","转入整理格局","减仓交易","基本面变化不大","进一步上涨的空间有限","操作仍需谨慎","做多的时机仍然未到","多单建议考虑暂时止盈",
                "高位反复","有望止跌","参与反弹风险仍较大","横盘震荡概率较大","不建议趋势性做多","价格企稳","不建议单边","空单暂且回避","矛盾或将继续","关注商品反弹能否延续","等待方向突破","长期逢高沽空","难对价格构成较大驱动","压制反弹高度","一线波动","空仓","不确定性较高","油价依旧决定","反弹难反转","空间料也不大","震荡行情将延续","基差方面或继续走强","不抄底","跟随原油为主","震荡思路操作","有一定反复","操作上建议观望","跟随油价震荡","不宜过分看空","高位运行","不建议进场追多","继续向下的空间更加有限",
                "回归整理区间","逐渐止盈","低位止跌","下跌空间将受到限制","贵金属波动加大","不建议介入空单","反弹有限","下移可能性较小","区间内运行","上方仍存压力","强势难以延续","空单可部分止盈","下跌空间有限","短线交易","震荡走势","跟随油价波动","高位宽幅波动","震荡走势为主","限制上涨动能","难有走强动力",
                "建议观望为主","制约短期下行空间","无明显涨跌趋势","限制短期价格回落","制约盘面上涨高度","短期谨慎为宜","上行压力增大","震荡概率大","多配的风险较高","空间有限","不追涨","有望完成筑底","难大跌","没有出现大的矛盾","向上空间或有限","继续关注外围市场的变化","缺乏基本面驱动","宽幅运行","谨慎操作","不建议虚盘操作","短期中性","持币观望","套保压力仍较大","反弹空间或受限","不建议买入","反弹可持续性不足",
                "尚未出现短缺","没有明显驱动","持稳运行","不建议再追空","压制持续反弹空间","持续上行阻力","区间能否突破","短空离场","建议暂时望","下行空间有限","震荡指标操作","区间思路","上涨动能仍不足","缺乏推动行情持续走高","不建议空配","建议轻仓操作","难以突破","需要等待","预计震荡","是否带来进一步利多","不建议单边做多","上行驱动较弱","高点很难预估","下行空间或有限","中性为主","维持震荡趋势","震荡思路对待","供求两淡","不建议单边追空","自身主导意愿并不强","高位盘整","高位整理","宽幅波动思路对待",
                "谨慎对待","定投方式参与","豆粕菜粕菜油关注","上涨动能减弱","显现出下跌抵抗","基差出现明显走弱","继续拉锯","上方空间不宜乐观","反弹预期偏弱","买近卖远","两难境地","呈现胶着","继续调整","继续震荡","下方空间有限","强现实弱" ,"出现反复","盘面看震荡","不具备做多的条件","保持震荡","转为震荡","低多高平","区间交易","处于震荡状态",
                "区间操作","难以形成有力的向上驱动","持续上涨动能不足","有反复","反弹空间持谨慎态度","继续上涨动力减弱","维持前期企稳格局","比较震荡","供需双增","谨防冲高回落","上行承压", "上行乏力", "震荡对待", "先扬后抑", "短期反弹,趋势偏弱", "下行驱动逐渐放缓","本线附近震荡","震荡格局","波段操作",
                "反弹难持续","盘整","下方空间或相对受限","向上空间也有限","等待试多机会","不宜追涨","多单高位减仓","多单做好止盈","限制铜价上方空间","区间宽幅整理","振荡调整格局","策略暂无","震荡趋势不改","能否继续反弹","反弹相对有限","低位高波","等待低多机会","风险仍大于收益","并不是投资黄金的最佳时期","合约震荡","主力合约震荡","轻仓参与震荡","不建议单边追空","窄幅整理","区间波动","区间调整为主","区间内短线参与","若能有所回落",
                "短期盘面呈震荡","处于整理","续跌空间有限","利空暂时不大","拐点或已临近","上方震荡","上行空间受限","难有大幅下跌空间","下探空间相对有限","后期宜谨慎","建议观望","暂无利好","近月不追空","短期建议观望","等待行情","区间交易为主","不宜追空下跌近尾声","观望为主","理性等待","区间策略","底部震荡","震荡区间","上行空间或受限"]
point_8 = ["短期反弹,趋势偏弱","加仓多单","先扬后抑","底部价格已现","底部已现","短线持多","震荡偏强对待","短期新高",
                "短多看待","多单轻仓持有","昂扬向上","产生支撑","修复回补","小幅走强","突破上方强压","合约多单","逢低建仓多单",
                "小幅反弹","买入操作","短线多单参与","多单可持有","多单进场","仍有上冲基础","结构性反弹","保持强势运行","多单可考虑继续持有","多eb","利多玉米价格","多单择机进场",
                "利多","短线多单","多头持有","涨势将会持续","继续买入看涨期权","价格上涨","多单继续进场","快速拉升","延续涨势","尝试追多","价格中枢上移","利润向上修复","止跌回涨","多单建议继续持有", "多EB","多单重新入场"]
point_7 = ["多头谨慎持有","或重回","推高原油价格","维持涨势","可能会带来阶段性反弹","逢低偏多","逢低做多","逢低多", "去买","波段多","多单依托","筑底反弹","多单暂持","止盈上移","驱动向上","短线低多","多单可继续持有","领涨油脂","多头买入机会","偏涨看待","拉涨不锈钢","中长期多头配置","短多交易为主","逢低做多","反弹小周期应未结束","逢低试多","供需偏紧","生产收紧","逢低多","下游补库态度积极","支撑短期价格","缓慢上抬","多单短线持有","支撑铜价",
           "警惕多头逼仓风险","冲击1月份","中枢有望明显抬升","短多为主","推涨价格","持续回弹","短期或带动期货盘面反弹","逢低布多","附近的买入机会","多头和裂解机会","多配","推升油价","刺激一波","下行空间料大于","难摆脱低迷走势","明显挤仓",
           "短期处于上攻","逢低择机买入","重心或上移","仍将继续上移","冲高风险","坚持多头策略","多头依托","可入场多单","入场建多","看跌期权卖权持有","继续保持看涨","短期或震荡偏强","逆势上涨","多头背靠","利好价格","高开高走","多单择低介入","向上选择方向","价格受支撑","短期震荡偏强","多头配置","作为多配","抬升不锈钢期货价格","持续支撑","维持震荡上扬","具有低位做多驱动","逢回调做多","缓慢上涨","震荡向上",
           "参与做多行情","多单暂时持有","震荡偏多思路对待","多单可带止盈继续持有","逢低接多","逐步布局05多单","多单止损设","多思路","维持看多观点","会冲击7万","低多机会","前多依托","维持看涨观点","左侧买入交易","预计随之上升","价格向上运行","有短线布空机会","逐步上移","多单逢回调","可布局多单","多头择机换月持有","考虑买入","前多继续持有","多单止盈上移","推涨镍价","波段做多","止跌回升","多单考虑进场","回调介入","偏强震荡思路","有望走出强趋势","价格走强","有望抬升","低买","赋予上行动能","顺势做多","稳中向好","区间弱势波动","低多思路","布多机会","短多持有","低位多配","逢低布局远月","反弹回升","顺势空头","小步向上","走势偏强","多头敞口","利多短期价格", "低位多单可以轻仓持有", "回撤接多","重心震荡上移","成本持续推动","附近做多","预期向好","附近做多"]
point_5 = ["多单谨慎持有","轻多注意节奏","建立多单","支撑了涨势","建议低多","逢低参与","考虑逢低参与","市场预期有所改善","稍有涨价","中长期仍维持偏强走势","逢低试多不追高","短期存底部支撑","逢回调建立多单","高位压力","中性偏强","偏紧态势持续","回调偏多","现货仍旧偏强","少量持有","剩余多单跟踪止损","低位多头继续持有","稳中小涨","库存偏低现货强势","压力迫近","或引发空头踩踏","多单关注","逐步回暖","低多配置","中期多单持有","低位买入机会","低位做多","或带来一定幅度的反弹","多单续持","有望不断去库存","逢高适当减仓","在手多单","集体反弹可能","中长期操作建议偏多","波段多单","高度可能有限","轻仓逢低做多","高度可能有限","布局长多","反弹力度或有限","中长期看多","酝酿反弹机会","观望或短多","回落可止盈离场","节奏性做多","低点支撑","涨势趋缓","回调接多为主","估值修复思路对待","中线轻仓逢低买入","反弹幅度有限","滚动低多","短多长空","下游补库积极",
           "冲高一波后再回落","找机会买","轻仓跟多","回调布多","前多轻仓","中期仍考虑逢低参与","期权可短多","少量多头","炒作窗口","跟随黄金","上行风险增大","回调介入短多","置止损短多","政策面利好","支撑矿价","短期驱动向上",
           "短期获支撑","空头避让","买盘价值提升","谨慎做多","轻多短线参与","回调伺机做多","中长期依然看多糖价","低多为主","压力位上移","回调偏多交易","小幅回暖","回落偏多","回调接多","回调后的做多","技术性修正的需求","中枢上移","或有补贴水行情","利润有望继续修复","短线低吸","回调企稳逢低做多","中期多头配置","回调仍是买入机会","多头信心加强","贴水有收窄预期","震荡略偏强","难有大幅上涨的趋势性行情",
            "不过于追多","宏观暂时偏强","买入布局机会","长线si2312多单持有","低吸为主","等待下跌后布多","支撑仍强","上涨明显","存反弹可能","短期多单注意节奏","再进入最后一波的上扬","上涨持续发力可能需要更多时间","超跌反弹","带动回升的可能","相对偏强势","获得向上驱动","回落试多","方可重新入场做多","短多或逢反弹减仓","中长线则看多黄金","被动涨势","等待低吸","反弹谨慎","逢低买","回调后的买入机会","反弹偏谨慎","谨慎乐观","多单谨慎","有情绪性买入价值","有支撑","大涨不追","到支撑作用","轻仓布局中长期多单","有一定支撑",
           "估值修复的可能","中期关注01合约多配机会","可以轻仓买入","多单注意节奏","时择机逢低买入","上涨才够坚实","小幅上涨","激进者可考虑试多","震荡回弹","是否存在修复性反弹","小幅推涨","设止损做多","可设置止损参与做多","走强的带动","或止跌回升","观望或短多","或仍偏强","易跟随情绪反弹","轻仓做多","回落买入机会","谨慎反弹","重新关注多头逻辑","或有反弹","进一步抬升的可能性","关注估值低位回补的机会","多单可部分止盈","等待后期布局多单机会","盘面震荡向上","重心小幅上移",
           "上涨阻力增大","低位谨慎偏多","轻仓布局多单","仍然会较弱","一定程度助推","回调做多","逢低入场","仍有抬升空间","支撑较强","中线多单持有","跟涨的一个因素","提供强支撑","轻仓逢低买入","搏一波小幅反弹","或支撑价格","中长期偏多操作","中期做多机会","逢低轻仓参与反弹","支撑逐渐增强","上涨幅度恐有限","回落买入为主","不追高","价格存在支撑","回调企稳接多","震荡略偏多","价格小幅上移",
                "多EG","建立一些多单","看涨情绪增加","企稳以后再买","短多近月","回调后多头参与","震荡向强趋势","少量多单","隐含阶段性反弹","少量近月多头持有","少量多头持有","谨慎追涨","少量低位多单持有","最大的支撑","震荡平台有望上移","反弹的幅度取决于","轻仓参与做多","回调低吸","轻仓适当回调做","回撤接多为宜","苏式震荡反弹","回调幅度有限","考虑低多策略","不宜追多","短线炒作","支撑尚存","上方空间有限","炒作未止","逢高部分止盈","可尝试多单","期价仍受支撑","增强底部支撑","偏暖震荡",
           "反弹高度不乐观","卖出看跌期权","低价接货","存挺价意愿","反弹不会太顺畅","后期企稳以后再加仓","长线操作以逢低买入","有一定买入价值","存在反弹驱动","逢低布局","逢低布局2209合约多单","较强支撑","低位机会","逢低吸纳","盘整向好","可能推升价格","拉动价格进一步提升","逢低轻仓做多","低库存下的上涨弹性","回调去布局多单","暂时支撑铜价","小幅反弹","重心或小幅上移","基本面存支撑","等待回调做多机会","惜售心理增加","弱反弹走势","裂解价差高估","回调到位后做多",
                "易涨难跌","均线多头操作","有小涨可能","再继续波段买入","整过后仍可逢低建多","回调以后可以买入","多单布局","多单为宜","相对看多","轻仓多单暂谨慎持有","或即将迎来止跌企稳","少量买入","或有所反弹","具有相当强劲的支撑","窄幅回升","震荡向上趋势不变","企稳买入","弱反弹","仍偏强","多单轻仓","有继续上移的条件","逢低轻仓买入","轻仓低多为主","谨慎追多","形成托底","多单少量参与","支撑盘面","多单滚动操作","一定提振作用","贴水收窄","远月驱动渐显","轻仓试多","可低吸","成本端支撑仍存",
                "持有前期多单","将对多头更有利","仍可能上冲","低多机会","回落后择机做多","上涨幅度相比会有所放缓","回落做多","底部反弹可能","多头持仓短线","多单仍少量持有","不排除调整后继续冲高","多头离场位置","存在反弹要求","基差向上修复的可能","超跌","估值偏低","向上支撑","谨慎看涨","观望或短多","反弹的持续性可能不会太长","回落买入","获得一定的支撑","有修复需要","观望或者搏一波反弹","回调后再度入多","轻多尝试","反弹强度不及","远月企稳谨慎偏多","回调买入","重心上移","轻仓多单持有","存在支撑","适量买入","逢低短多","轻多跟随","价格持续向上压力也在加大"]
point_3 = ["买近抛远","多单可盈利减仓","上行空间不大","偏多思路逢高离场","供需结构有所好转","不建议做空","反弹高度不宜太乐观","不要追高","缺乏大幅反弹动力","反弹空间相对有限","难以走出独立向上行情","不建议追高","短期阶段性调整","难有太大的上涨驱动","反弹震荡","秋冬季需求回升的利多","中线来看上行空间较为有限","多单减持","但不宜追高","边际向上驱动有所减弱","压制价格上方想象空间","谨慎追高","多单适当减仓后持有","抗击通胀工作尚未完成","多单减仓","多单续持或逢高减仓","警惕冲高回落","以及上涨过快后资金多头撤退","多单减量持有","多单可适当减仓","多单注意减仓","价企稳","涨势趋于放缓","仍获支撑","多单适当减仓","小幅关口反弹","难以带来趋势性上涨","估值已经比较低","尝试性反弹","暂时企稳","跌后反弹的可能","等企稳再买入","未完全进入正反馈","看多拥挤的风险","才有上涨机会","回调低位吸入","企稳后买入","上涨动力能否持续","支撑盘面","逐步企稳","回调以后再买入","空间也相对受限","买入虚值看涨期权","供需格局向好","回升空间较为有限","反弹空间预计不大","走势相对坚挺","多单减仓后持有","仍较抗跌","需求或有起色","做多的时间窗口开放时间可能并不算长","对盘面形成支撑","支撑浆价高位走势","需求有待释放","给出支撑","构成支撑","小幅强于内盘","需求预期较好","上行周期仍然没有结束","等待反弹","支撑钢价","再轻多介入","略有好转","等待逢低买入机会","再做偏多配置","反弹的短多",
           "反弹高度受压制","空单暂时回避","进入企稳","支撑短期铝价","大幅反弹的可能性不大","做空尚未看到驱动","上行的空间不会太大","冲高不追","追涨谨慎","高位逐步止盈","限制PVC期货上涨空间","谨防反弹","继续向上高度不会太高","等待逢低做多机会","被动跟涨","技术性反弹","价格得到支撑","上涨将有一定抑制","逢低持有","等待更好的采买机会","后可逢低试多","后的做多机会","潜在利多","后期可望进一步提升","企稳运行","上冲动能稍显不足","弱势反弹","逢高止盈","冲高有限","构成一定支撑","逢高减仓","反弹持续性也会存疑","难跌","短多可减仓","短多减仓","多单注意做好止盈","形成一定支撑","反弹力度渐弱","上涨动力仍显不足","没有看到太多的反弹空间","不利于价格反弹","支撑价格","做多或将存在一定风险",
           "企稳态势","反弹空间不易看太高","仍存在强支撑","持多可以考虑逐步止盈","不适合做空","回调后低多","反弹力度总体有限","限制远期价格上涨","逢低短多或观望","多单减仓持有","基本面支撑并不强","高位止盈","价格有支撑","不利于价格反弹","有利支撑","反弹的高度可能有限","不具备连续大幅上涨","向上反弹的阻力位","不具备持续大幅上涨","企稳态势","有所企稳","等待回调接多机会","后续做多机会需考量","带来的止跌企稳甚至反弹风险","低位企稳","高位维持","多单暂时离场","需求端改善","抑制原油价格飙升","反弹幅度受限","上行动能有限",
           "涨幅正在遇阻","多单择机止盈","没有上行的驱动","反弹高度或相对有限","再寻找买入机会","反弹可持续性还要参考","关注能否向上突破","反弹也将受限","上行空间仍将受限","低多是主方向","反弹或有限","高度有限","下方支撑渐显","不宜过分看多","短空止盈","下跌之后反弹","多单建议考虑逢高逐步止盈","反弹的高度受限","回调空间有限","反弹高度将一般","做多性价比有限","上方空间或有限","多方仍有一定压力","上涨有限","仍存支撑","上涨持续性仍待观察","有反弹的概率","价格仍存支撑","下跌动能不足","短时超跌反弹","支撑仍在",
            "空单止盈","关注做多情绪是否转好","难有显著的向上空间","空单退场","限制其反弹空间","等待回撤后再入场","空单离场","不具备趋势性上涨动能","回调后买入","中线维持多头思路","等待回调企稳","反弹幅度非常谨慎","多单减仓持有","无法顺畅大涨","呈现抗跌","警惕玻璃等品种弱势给纯碱带来的负面反馈","未见改善","择机短多参与","上行压力仍较大","相对坚挺","反弹高度或受限","坚挺运行","存在压力","不宜过度追高","上行仍需等待驱动","震荡止跌","支撑依然在","短期将有所支撑","逢低多但不要追多","不具备趋势性上行动能","不必过度悲观","不轻言单边做空","继续下跌的空间有限","反弹力度有限","止跌回调","继续上行动能或将减弱",
           "限制价格回落","有所支撑","谨慎最高","上行产生一定阻力","上行空间或将小于","难以大涨","仍有上行风险","限制反弹幅度","偏紧的格局","多单适当减仓后持有","多头可适当减仓","市场情绪向好","关注前期低点支撑","维持坚挺","整体反弹对糖价支撑","上行空间不看高","多单逢高减持","多单注意减仓","下方支撑增强","下方支撑较强","后再做多","成交好转","一定支撑","限制油价反弹高度","企稳筑底","等待布局多单机会","反弹将面临","估值支撑","多单逐渐获利离场","反弹力度减弱","不会一帆风顺","不建议继续追多","上方的空间也不会太大","反弹持谨慎态度",
           "跌破成本尝试买入","大幅回调关注低多机会","上行高度受限","多单部分离场","多单可适当减磅","价压力缓解","有力支撑","追涨需谨慎","空单及时止损","多单暂可谨慎持有或适当减持","升水坚挺","处于估值底部","支撑国内豆粕价格","低吸机会","支撑期价","多单逐渐止盈","大稳小涨","库存下调","不具备很强明显的向上驱动","需求弱势逐渐兑现","多单注意减仓或止盈","存在一定支撑","缓慢转好","价格反弹力度较为有限","限制涨幅","存在底部支撑","涨幅受到限制","反弹幅度易受限","继续上行有阻力",
           "受到现货的制约","不建议过分追涨","反弹高度或有限","提振有限","逢低轻多","考虑将前期高位多单平仓","以上阻力较大","向上阻力加大","反弹压力位","有望筑底企稳","支撑油脂价格","等待回调底部买入时机","反弹空间预计有限","调整后的补多机会","难有大涨","对价格的提振有限","供需矛盾略有降低","反弹势头减弱","成本支撑尚在","多配对冲","多单逐步止盈立场","继续上行动力趋弱","难大涨","多单可以逢高减持","难明显回落","单边多头适当减仓","支撑有效性"]
point_neg_8 = ["近弱远强","前期空头继续持有","空单可继续","单边做空","有挺价心态","中枢持续下移","利空EG","布局01空单","空单上可以开始","顶部价格已现","顶部已现","反弹后抛空","逢高抛空","空单轻仓持有","维持下跌态势","做空远月合约",
                "短线空单参与","再次转弱","空单注意节奏","空单的建议持","维持偏空思路","逢高轻仓试空","卖出套保头寸","趋势空单参与","再度杀跌"]
point_neg_7 = ["回落","延续跌势","维持看空判断","可择机空配","开启回调","弱向震荡","保持空单为主","悲观情绪再度蔓延","开仓部分空单","会冲击7万","跟随沪铝回调","逢高布局空单","合约低多机会","逐渐开始回调","继续回调","仍有一定下探空间","或有所回调","逢高偏空","逢高空","逢高做空","或进一步下移","偏空震荡思路","仍偏弱","空头趋势","轻仓试空","回落调整","疲弱走势","再创低点","持有空单","打破下沿","齐跌","持以看空","维持看空态势","逐步逢高布局","空单逐渐布局","空单已经可以尝试","建立部分空单","抛空机会","整体持弱","布局远月空单","单边偏空","悲观看待","逢高建仓空单","看空单边","弱势运行","易跌难涨","走势可能趋弱","期价仍被高估","下行过程中波动较大",
               "负反馈进行","合约空单","顺势空头","依然承压","利空压制","整体维持空配思路","布空的机会","寻找逢高布局空单","短线空头可逐步建仓","可布局空头头寸","难有抬头空间","仍有下移空间","反弹后可介入空单","利空锡价","将进一步下移","跟随美豆补跌","存在较强的上行压力","反弹布空","反弹后择机做空","震荡偏空",
               "空单滚动操作","逢高布局FU2401空单","配置空头","反弹偏空","反弹后逢高做空","抛空的机会","有进一步下探","远月逢高空","氛围再度转悲","反弹做空","单建议设置止盈","短期压力加剧","反弹逢高做空","压制近月价格","偏弱震荡","逢高试空","弱势震荡","或将探低","负反馈持续","保持看空",
               "跌势为主","上方空配","空头入场","逢高沽空","空头暂持","空头可继续持有","短期看空","滚动空","高位做空","建议空配","空单续持","趋势下移","向区间下沿运动","布局远月空头","打压油价","跌势的开始","价格或将继续下移","维持下跌态势","颓势难改","择机布空","领跌油脂","震荡偏弱运行","偏弱运行","运行重心或将下移","或继续向下","逢高布局各品种空单","空配位置",
               "继续探底","加空单机会","逢高偏空参与","震荡向下","期价或将继续向下","有重新下跌可能","建立远月多仓","中枢仍将下移","仍然看空","逢高空滚动","空头择机进场","形成利空的影响","建立空单","再度跌落","逢高继续抛空","负反馈预期加重","反弹可空","反弹抛空","承压震荡","将跌破","逢高布空","继续看空","创出新低","继续下探","反弹压力位试空","的空头机会","下行风险犹存","利空有色金属","高空","利空依旧存在",
               "较强上行压力","开始空配","顺势空头思路","将继续向下调整","偏空震荡","向下压力明显","空单换月后继续持有","短线空头","价格中枢或有所下降","面临一定的调整压力","向下调整的趋势","短期维持悲观","配置近月空单","在手空单止损宜下移","仍有向下调整的动力","价格往下调整","或将快速掉头","价格走弱","相对承压","空单设好止盈","深度探底","价格偏弱运行","价格仍有一定下行空间","宽幅震荡偏弱","关注高位布空机会","高位时布空机会"]
point_neg_5 = ["下行驱动逐渐放缓","或面临压力","空单逢低减持","反弹后的放空机会","多单规避","多头信心不足","反弹跟空","偏弱调整","反弹继续空","短期回调","高位回调","中长期偏空","驱动依然向下","等待高点抛空","存回调的可能","增持套保空单","上方仍有压制","驱动依然向下","短期波动向下","存回调压力","等待反弹后的机会","缺利多","或有调整压力","仍面临一定压力","长线有下行驱动","回归上周五反弹前的起点","面临的回调压力将增大","面临回调压力","仍然可能面临下跌","空单维持小仓位","震荡偏弱势区间运行","中长期以空配为主","中期承压运行","可能出现的持续回调","情绪面不太乐观","形成持续压制","供需偏弱","继续调整","中长期逢高做空","走势已然转弱","延续调整概率大","中线继续考虑逢高沽空","压力位的卖压","向下回归可能","中长期逢高空","两端压力","仍弱","中期偏弱","仍有布空机会","下方仍有空间","仍有步空机会","无法形成支撑","反弹后空配","面临较大压力","波段空","反弹试空","震荡探底","未有明显改善","有转弱预期","补跌的概率较大","转向联储加息前的宏观交易","可能给出向下空间","有向下压力","谨慎偏空","谨慎看空","成本具备下移空间","择机空单进入","处于下降通道","存在向上空间","突破6000大关的日子应该不远","可能随之下堕","不会独善其身","空单可轻仓布局","压制短期价格","易再次走向负反馈","可适当空配","中期还是偏弱","再建立空单","依然不佳","寻机会抛空",
               "进一步测试低点","反弹择机布局空头","有重新跌落的风险","有回调的可能","有高位空单可加仓","带来利空情绪","面临一定回调压力","或存在回调需求","中长期逢高做空","弱势调整","需求无亮点","价格压制","偏弱势","开始不乐观","向下压力大","悲观下的普跌","逢高轻仓短空","轻仓布空","持续承压","长线保持逢高做空","压力陡增","多比做空好","冲高转跌","反弹预期再度破没","观望或区间上沿少量试空","中线仍以偏弱震荡","无明显上行驱动","反弹短空","中期仍偏弱","下行风险仍存","小幅反弹","上方建立空单","偏弱局面继续震荡","等待反弹再空","难言止跌",
               "逆势做多风险较大","空单注意盈利保护","将继续向下调整""将形成向下破位","存在回调的可能","累库压力加大","在反弹高点卖出虚值看涨","支撑位逼近","反弹加空","空单注意获利减仓","远月逢高空","利多出尽后的利空","对国内糖价构成压力","寻找合适的底部位","跌幅或将放缓","难言企稳","后期仍有承压","轻空","形成拖累","关注下行风险","难以有效实现企稳","供需预期转弱","抗跌可能将是短期","弱平衡","下跌空间不宜太悲观","难乐观","弱稳运行","寻找高位震荡区间下沿","中期压力仍在","空单分批止盈","逢高建立空单","不过于追空",
               "空单谨慎","进一步向下展开调整的压力","震荡寻底","反弹后空","关注后市寻空机会","带来的回调风险","利空玉米需求","谨慎承压","面临调整","反弹后加空","逢高布控","下方存在一定空间","构成上方压力","偏空操作低位落袋","等待反弹加仓机会","走势不乐观","难成反弹走势","有回调可能","供需双弱","压制期价上行","价格承压","弱于黄金","难有反弹","重心继续下移","难有支撑","关注能否向下突破",
                "上行空间也较为有限","延续调整态势","冲高再加","上涨再逢高布局","空单可轻仓持有","仍将重拾跌势","有一定回调压力","存降价预期","上涨过程里的抛压","对盘面支撑不足","寻低企稳","不排除高位回落可能","中长线持空","有继续下移可能","轻仓尝试空","中期反弹做空","中线仍考虑逢高做空","中长期供给压力下的下行趋势","压制价格","空单继续持有或止盈离场","将跟跌","少量试空","反弹继续做空","轻仓试空","短线可适当沽空","潜在做多机会","中期趋势仍偏弱","短期弱势震荡","偏弱震荡思路","观望或维持逢高短空","短期将面临调整","预期悲观","后期仍有走跌压力","轻仓做空","价格仍有下行空间","价格仍有一定下行空间","重心下移","下调风险","难有趋势性上涨行情","持续性压制","重心或有下移","先抑后扬","难长期维持在当前高位",
                "空单谨慎持有","反弹短线空单","再择机高位空","悲观情绪有待消化","继续持有套保空单","谨慎追空","向下驱动将持续存在","空头保持谨慎看法","情绪不太乐观","布局中线空单","仍有拉动","待后续缺少持续性上涨动力或迎来新一轮回调","轻仓偏空","偏空思路短线操作","向下仍旧是价格需要警惕的风险","仍存在下行压力","都是布空的时机","利空偏多","空配机会","依然为较空配","内外价格疲弱","不宜过分看跌","反弹再空","观望或逢高少量试空","等反弹以后继续抛空","拐点或已逐渐显现","空单布局周期拉长","再小跌","少量买入看跌期权","短线仍有回调压力","空单长期持有","长期仍逢高空","反弹的短多","如果想参与做空","限制价格大回升","短空长多","谨慎悲观","贴水继续走弱","看空也会偏短暂","轻仓做空远月合约","施压", "压力未消退","压制乙二醇价格"]
point_neg_3 = ["短多止盈","下跌空间也有限","反弹或短暂而悲壮","寻求进一步的支撑","不存在大幅回落空间","没有强力的下跌动力","支撑不足","无向上因素","继续向下的空间不大","偏弱但跌幅并不大","空单入场才方为稳妥","下跌趋势放缓","跌幅或收窄","回避多单","情绪依旧不强","回调空间料有限","压力位承压","大幅低开则不宜继续追","调整幅度预计有限","不宜重仓做空","大幅下行空间也较为有限","调整幅度暂不看太深","下跌空间或有限","不建议盲目追空","难以支持铅价进一步上行","仍不乐观","后市压力可能逐渐显现","不足以大幅下跌","等待新的上涨信号","下行空间也有限","空单减持","冲高后或有做空机会","长线价格有下行驱动","关注产量增加后累库能否兑","待沽空机会","空单部分止损后持有","供给压力犹在","中期操作可待价格反弹后布局空单","不建议重仓追空","不宜过度看空","反弹行情难以持续","等待逢高空","暂时没有上涨驱动","有所抵抗","有拖累","考验硅铁成本支撑","中期建议关注反弹后抛空","等待空头机会","空单减仓","空单可以适量减仓","短空长多","利多出尽","反弹后依然会承压","不看过分下跌","向下的动力预计将有所减弱","价格已位于高位区间","成本支撑依然不减","进一步回落或有限","支撑较弱","难以大跌","等待逢高做空的时机","谨慎追高","有调整需求","空单可考虑避险","回调幅度相对有限","注意随时冲高回落行情","后期仍将面临调整压力","或将出现拐点","逢高空的性价比应该是高于逢低买","高位调整","表现疲软","上方承压运行","上方阻力",
               "有一定支撑","跌幅或较为有限","待盘面承压后考虑逢高做空远月","难有大幅下滑空间","延续宽松","反弹至前期压力位再空","行情走软","或小幅走低","将相对较弱","反弹后短空","中期走势仍不乐观","进一步下跌空间亦将有限","压制期货盘面","存在较强的挤压","跟随原料弱势运行","布局空单需拉长","限制铜价深调","更容易受到负反馈","见到空头入场机会","缺乏利多","暂难对市场带来有限提振","或面临60日线压力","基本面疲弱","进入底部区域","限制价格回升","难以形成大熊市","空单逢低离场","预期不宜乐观","并不乐观","现货有所松动","过分乐观","反弹行情结束",
               "弱势盘整","需求仍然偏弱","缺乏需求的上行驱动","警惕回调风险","暂不支持期价有持续上行空间","长线有下行驱动","做多方案止损","累库压力会逐渐上升","空头短中期需警惕","再参与做空",
               "空单逢低注意及时出场","上行受阻","压力不减","成为反弹的最终阻力","等待布空的机会","上方压力较大","再做空","上方压制仍存","不宜看得过深","缺乏利多因素","向上言早","向上驱动力依旧偏弱","底部运行","短线反弹追涨需谨慎","库存出现积累","存在贴水修复的可能","上行驱动较弱","震荡低位运行","不过于看空","限制铜价反弹","反弹至高位再空","库存持续累积","上方仍然存在压力","下行空间或不大",
               "回落空间或有限","回避逆势做多","逢高做空远月升水合约参与套保","关注回调风险","相对抗跌","弱势暂看","近月合约面临较大压力","空单减仓持有","难以走入大熊市","并未走出继续改善的趋势","反弹稍显乏力","不过度悲观","不追空","不建议大举追空","反弹无力","不是做空的最佳标的","反弹承压","追空需谨慎","短多或逢反弹减仓","无法驱动上涨行情","不建议持有多头","未见明显上行驱动","回调空间相对有限","继续下行空间不大","存在一定压力","下方空间不大","情绪降温","供给较需求偏强","调整深度不宜看得过深",
               "高位调整压力","难有显著反弹","很难走出反转趋势","回调空间料将受限","回调幅度或相对有限","下方空间也有限","需求仍维持羸弱","稳中偏弱","略偏空","弱预期运行","限制反弹动能","难以反弹","等待沽空机会成熟","不利于硅铁价格上行","回调的幅度有限","空单逐步止盈","不具备连续大跌的基础","下跌空间也不大","持续下行的空间可能将相对有限","上行空间有限","空单逐步逢低离场","上行压力加大","等待反弹更好价位","难以上行","上行动能不足","高位松动","难有向上驱动","逢低落袋","价格稳定偏弱","抑制盘面持续下行","空单可逐步平仓","不容乐观","跌势放缓","期价难大跌","抑制反弹空间","缺乏持续做多的逻辑支撑","缺乏上涨动力",
                "多单止盈","不至于趋势下跌","警惕价格回调风险","空单等待入场机会","不易追空","不利于锌价走高","进一步深跌难度较大","难有上行驱动","弱势波动","表需偏弱","盘面仍有调整压力","压制矿价的上行空间","不利于国内糖价反弹","空单开始逐步止盈","估值压缩","下方空间亦有限","限制反弹动力","短线空单轻仓","下跌会有所放缓",
                "压制上行空间","不建议再做多","无利多","下行回落企稳","下跌空间不大","中期仍需关注冲高承压风险","卖出虚值call","上涨的逻辑逐渐瓦解","谨慎看待上方空间","价格较难反弹","整数压力持续","空单考虑阶段性减仓","难有持续强势表现","等待布空性价比更高","空单开始分批止盈离场","空单逢低减仓","前景仍不乐观","低位运行","空单可适当落袋","弱势震荡","附近压力","宏观压力来袭","空单适当减持","上方压力大","支撑有限","存在上行压力","往下调整空间可能是有限","上行无力","多单离场","较为乏力","限制上行高度","限制上方空间","限制其上方空间","现阶段性回调","区间小幅调整","小幅调整","上行空间十分有限"]

import jieba


for i in low:
    jieba.add_word(i)
for i in high:
    jieba.add_word(i)
for i in to_continue:
    jieba.add_word(i)
for i in zero:
    jieba.add_word(i)
for i in point_8:
    jieba.add_word(i)
for i in point_7:
    jieba.add_word(i)
for i in point_5:
    jieba.add_word(i)
for i in point_3:
    jieba.add_word(i)
for i in point_neg_8:
    jieba.add_word(i)
for i in point_neg_7:
    jieba.add_word(i)
for i in point_neg_5:
    jieba.add_word(i)
for i in point_neg_3:
    jieba.add_word(i)


def simplify_sent(c):
    # first_tmp = test.chatgpt(c)
    # if first_tmp != "" and isinstance(first_tmp, str) and chatgpt_test.is_number(first_tmp):
    #     #print("real result: " + first_tmp.strip() + '\n')
    #     return first_tmp.strip()
    cut = jieba.cut(c)
    cut_list = []
    for i in cut:
        cut_list.append(i)
    cut_list.reverse()
    #print(c)
    #print(cut_list)
    if "不追空" in c or "不追多" in c:
        return "0"
    # if "短线反弹" in c and "短线反弹追涨需谨慎" not in c and "短线反弹预期" not in c and "短线反弹周期" not in c:
    #     return "0.7"
    for c in cut_list:
        continued = False
        for i in to_continue:
            if i == c:
                continued = True
                break
        if continued:
            continue
        for i in zero:
            if i == c:
                return "0"
        if "滚动操作" in c and "多单滚动操作" not in c and "空单滚动操作" not in c:
            return "0"
        if "持续震荡" in c and "持续震荡偏弱" not in c and "持续震荡偏强" not in c:
            return "0"
        for i in point_8:
            if i == c:
                return "0.8"
        for i in point_7:
            if i == c:
                return "0.7"
        for i in point_5:
            if i == c:
                return "0.5"
        for i in point_3:
            if i == c:
                return "0.3"
        for i in point_neg_8:
            if i == c:
                return "-0.8"
        for i in point_neg_7:
            if i == c:
                return "-0.7"
        for i in point_neg_5:
            if i == c:
                return "-0.5"
        for i in point_neg_3:
            if i == c:
                return "-0.3"
        for i in high:
            if i == c:
                return "1"
        for i in low:
            if i == c:
                return "-1"
    return "0"
