low = ["反弹难持续","布局空单","空头持有","偏弱震荡","偏弱", "下滑", "弱势", "下行", "走弱", "做空", "偏空", "下跌", "试空", "短空", "空单操作", "偏弱","向下压力较大","空头思路","抛空为主","反弹抛空",
       "逐步布空","承压", "超涨", "沽空", "回吐", "逢高空", "下破", "跳水", "弱调整", "弱趋势", "冲低", "止损上冲", "赶底", "走低", "大跌", "布局空单", "持空","下调",
       "高抛","反弹空","继续下挫","继续受挫","下挫","进一步下挫","施压","空单继续持有","偏弱运行","回调整理","空单持有","鹰派信号","压制铜价","持续偏弱","关注做空机会","逢高空","震荡趋弱"]
high = ["布局多单","偏强震荡","重归反弹","继续向上","向上突破","破新高","多TA", "偏强", "上涨", "走强", "偏多", "做多", "试多", "上行", "乐观", "强势", "走强", "提振", "坚挺","探底回升","企稳反弹","存在反弹机会",
        "反弹", "回升", "短多", "多单操作", "超跌", "沽多", "逢低多", "上破", "强调整", "冲高", "下冲", "赶顶", "走高", "大涨", "布局多单", "持多","逢低多", "反弹修复","多单参与","多单参与为主","以超跌做多",
        "上调","多单继续持有","多单背靠","谨慎看多","逢低增持","双向回归","期价反弹","触底反弹", "继续反弹","向上修复","减仓反弹","底部反弹","支撑较强","逢低买入","多头思路","价格反弹","历史新高",\
        "关注做多机会","利好短期价格","多单可以继续持有","多单持有","继续爬升","利润持续修复"]
to_continue = ["才可能企稳回升","才可能企稳","议做多裂解价差","加工差承压","开工下滑","难提振","FU偏强","油价压力","回调风险逐步降低","积极性回升","下跌主要来自",
                "油粕比空单","基差回落","未透露更多鹰派信号","等待价格企稳","产量回升","价差有望走强","胀预期回落","外盘下跌","上涨的兑现以后","若成品油价格回落则将带动原油走低",
               "极性回升","不锈钢价格的上涨","等待利多的基本面","正套逐步止盈","做多钢厂利润","结合油价下跌","逢低做多短纤与","谨防随时承压回落","月底交割之后市场情绪回落",
               "产业客户等待回落","套利:观望","升水能够有所回落","做多短纤与 PTA 价差","随着焦炭价格下跌",
                "防范价格下跌风险","价差有望走强","难以大幅走高","短线的回落","回调的风险","加工费回调空间有限","利润持续走低","逢低做多短纤与 PTA 价差","警惕期价连日上行后的回调风险"]
zero = ["震荡对待","上行空间受限","下行空间受限","波动风险加大","震荡为主","高位震荡","盘面震荡","反弹空间有限","反弹幅度已经较高","多TA空EG","价格承压阶段性","价格进入调整阶段",
                "反弹难持续","跟涨情绪减弱","阶段性震荡","震荡中","上行空间有限","下行空间有限","暂不做判断","仍难有强势表现","成本端的影响较大","附近震荡","难有上涨动力",
                "底部空间或将有限","短期内震荡行情","呈现震荡格局","震荡走势为主","震荡整理","反复震荡","观望","宽幅震荡","走势震荡","受原料端影响较大","维持震荡策略","震荡思路",
                "宽幅震荡运行","横盘震荡为主","低位宽幅震荡","震荡为主","仍有反复","跌幅大小","价格跟随原料","基本面变化不大","震荡一段时间","维持高位盘整","等待市场企稳",
                "上行阻力依然较大","维持区间震荡", "交割因素扰动","不建议空单操作","不建议多单操作","继续观望","反弹不可延续","震荡筑底","PX继续强势","维持震荡调整","逐渐企稳的概率较大",
                "锁定利润","旺季不旺","缺乏后劲","小幅整理","上行告一段落","或压制挤仓风险","不宜做空","反弹不可持续","日内短线参与","建议观望","反弹空间受限","警惕高位风险",
                "下行告一段落","风险尚存","震荡运行","低位震荡","上行有限","下行有限","暂时观望","不建议做虚盘","反弹空间或有限","寻找平衡","关注终端恢复节奏","限制贵金属上行动力",
                "多看少动","不做方向性预期","窄幅震荡","上涨驱动弱","暂时观望","难言乐观","短线震荡","表现震荡","建议观望","日内交易为主","上下两难的境地","限制反弹高度","维持震荡",
                "横盘整理","延续振荡","延续震荡表现","高位区间震荡","上行驱动不足","维持震荡走势","上行动力不足","区间震荡","做多钢厂利润","难有大跌","随成本端继续震荡","震荡调整",
                "仍难打破震荡形态","等待企稳","高抛低吸","短线交易为主","建议暂观望","整体震荡","多单逢高减仓","单边头寸谨慎","不会大跌","等待明朗","日内操作为宜","进入高位盘整走势",
                "单边观望","做空驱动不足","价格震荡","反弹行情阶段性结束","轻仓过节","减仓交易","基本面变化不大","进一步上涨的空间有限","操作仍需谨慎","做多的时机仍然未到","多单建议考虑暂时止盈",
                "高位反复","空仓","震荡行情将延续","跟随原油为主","震荡思路操作","逢高止盈","有一定反复","跟随油价震荡","不宜过分看空","高位运行","不建议进场追多","继续向下的空间更加有限",
                "回归整理区间","贵金属波动加大","空单可部分止盈","短线操作为宜","短线交易","震荡走势","跟随油价波动","短线操作","高位宽幅波动","震荡走势为主","限制上涨动能",
                "建议观望为主","向上空间或有限","缺乏基本面驱动","宽幅运行","谨慎操作","不建议虚盘操作","短期中性","持币观望","套保压力仍较大","反弹空间或受限","不建议买入","反弹可持续性不足",
                "尚未出现短缺","建议轻仓操作","高点很难预估","下行空间或有限","中性为主","维持震荡趋势","震荡思路对待","供求两淡","不建议单边追空","自身主导意愿并不强","高位盘整",
                "谨慎对待","定投方式参与","两难境地","继续调整","下方空间有限","强现实弱" ,"出现反复","盘面看震荡","不具备做多的条件","保持震荡","转为震荡","低多高平","区间交易",
                "区间操作","持续上涨动能不足","谨防冲高回落","上行承压", "上行乏力", "震荡对待", "先扬后抑", "短期反弹,趋势偏弱", "下行驱动逐渐放缓","本线附近震荡","震荡格局",
                "反弹难持续","等待试多机会","等待低多机会","合约震荡","主力合约震荡","轻仓参与震荡","不建议单边追空","短期盘面呈震荡", "上行空间受限", "建议观望","暂无利好","近月不追空","短期建议观望","等待行情","区间交易为主","不宜追空下跌近尾声","观望为主","理性等待","区间策略","底部震荡","震荡区间","上行空间或受限"]
point_8 = ["短期反弹,趋势偏弱","先扬后抑","近强远弱","底部价格已现","底部已现","短线持多","震荡偏强对待",
                "短多看待","多单轻仓持有","产生支撑","修复回补","小幅走强","需求回暖","突破上方强压","多EG空TA",
                "小幅反弹","短线多单参与","仍有上冲基础","结构性反弹","保持强势运行","多单可考虑继续持有","多eb"
                "利多","短线多单","价格中枢上移","利润向上修复","较强支撑","止跌回涨","多单建议继续持有", "多EB"]
point_7 = ["多头谨慎持有","偏涨看待","中长期多头配置","短多交易为主","逢低做多","逢低试多","供需偏紧","生产收紧","逢低多","下游补库态度积极","支撑短期价格","缓慢上抬","多单短线持有",
           "警惕多头逼仓风险","明显挤仓","短期处于上攻","冲高风险","价格受支撑","抬升不锈钢期货价格","持续支撑","维持震荡上扬","参与做多行情","反弹做空","小步向上","走势偏强"]
point_5 = ["多单谨慎持有","低点支撑","涨势趋缓","仍较抗跌","反弹幅度有限","短多长空","下游补库积极","冲高一波后再回落","跟随黄金","回调介入短多","置止损短多","政策面利好","支撑矿价","短期驱动向上",
           "短期获支撑","回落偏多","中枢上移","利润有望继续修复","短线低吸","回调企稳逢低做多","中期多头配置","回调仍是买入机会","多头信心加强","贴水有收窄预期","震荡略偏强","难有大幅上涨的趋势性行情",
                "不宜过分看多","不过于追多","被动涨势","反弹谨慎","反弹偏谨慎","谨慎乐观","多单谨慎","有情绪性买入价值","估值修复的可能","小幅上涨","谨慎反弹","或有反弹","进一步抬升的可能性",
                "多EG","谨慎追涨","回撤接多为宜","回调幅度有限","不宜追多","短线炒作","支撑尚存","上方空间有限","炒作未止","逢高部分止盈","可尝试多单","期价仍受支撑",
           "反弹高度不乐观","逢低布局2209合约多单","回调去布局多单","暂时支撑铜价","小幅反弹","重心或小幅上移","基本面存支撑","等待回调做多机会","惜售心理增加",
                "易涨难跌","仍偏强","多单轻仓","谨慎追多","形成托底","多单少量参与","支撑盘面","多单滚动操作","一定提振作用","贴水收窄","远月驱动渐显","轻仓试多","可低吸","成本端支撑仍存",
                "持有前期多单","轻多尝试","反弹强度不及","远月企稳谨慎偏多","回调买入","重心上移","轻仓多单持有","存在支撑","适量买入","逢低短多","轻多跟随","价格持续向上压力也在加大"]
point_3 = ["买近抛远","短空止盈","有支撑","下跌之后反弹","回调空间有限","反弹高度将一般","仍存支撑","上涨持续性仍待观察","有反弹的概率","价格仍存支撑","下跌动能不足","短时超跌反弹","支撑仍在",
            "空单止盈","不宜过度追高","震荡止跌","支撑依然在","逢低多但不要追多","不必过度悲观","不轻言单边做空","继续下跌的空间有限","反弹力度有限","止跌回调","继续上行动能或将减弱",
           "限制价格回落","等待布局多单机会","反弹将面临","估值支撑","多单逐渐获利离场","反弹力度减弱","不会一帆风顺","不建议继续追多","上方的空间也不会太大",
           "跌破成本尝试买入","需求弱势逐渐兑现","价格反弹力度较为有限","限制涨幅","涨幅受到限制"]
point_neg_8 = ["近弱远强","顶部价格已现","顶部已现","反弹后抛空","逢高抛空","空单轻仓持有","维持下跌态势",
                "短线空单参与","维持偏空思路","逢高轻仓试空","卖出套保头寸"]
point_neg_7 = ["回落","存在较强的上行压力","回调","短期压力加剧","偏弱震荡","逢高试空","弱势震荡","跌势为主","维持下跌态势","择机布空","震荡偏弱运行","偏弱运行",
               "继续探底","高空","较强上行压力","空单设好止盈","价格偏弱运行","价格仍有一定下行空间","宽幅震荡偏弱","关注高位布空机会","高位时布空机会"]
point_neg_5 = ["下行驱动逐渐放缓","弱平衡","不过于追空","空单谨慎","谨慎承压","有回调可能","压制期价上行","价格承压","弱于黄金","难有反弹","重心继续下移",
                "上行空间也较为有限","轻仓做空","价格仍有下行空间","价格仍有一定下行空间","重心下移","下调风险","难有趋势性上涨行情","持续性压制","重心或有下移","先抑后扬",
                "空单谨慎持有","不宜过分看跌","限制价格回升","短空长多","谨慎悲观","贴水继续走弱","看空也会偏短暂","轻仓做空远月合约","施压", "压力未消退"]
point_neg_3 = ["短多止盈","高位调整压力","上行压力加大","上行动能不足","难有向上驱动","价格稳定偏弱","不容乐观","跌势放缓","期价难大跌","抑制反弹空间",
                "多单止盈","盘面仍有调整压力","压制上行空间","存在上行压力","多单离场","限制上行高度","限制上方空间","限制其上方空间","现阶段性回调"]

import jieba


for i in low:
    jieba.add_word(i)
for i in high:
    jieba.add_word(i)
for i in to_continue:
    jieba.add_word(i)
for i in zero:
    jieba.add_word(i)
for i in point_8:
    jieba.add_word(i)
for i in point_7:
    jieba.add_word(i)
for i in point_5:
    jieba.add_word(i)
for i in point_3:
    jieba.add_word(i)
for i in point_neg_8:
    jieba.add_word(i)
for i in point_neg_7:
    jieba.add_word(i)
for i in point_neg_5:
    jieba.add_word(i)
for i in point_neg_3:
    jieba.add_word(i)


def simplify_sent(c):
    if "短期" in c and "长期" in c.split("短期")[1] and '。'not in c.split("长期")[1]:
        c = c.split("长期")[0]
    elif "短期" in c and "中长期" in c.split("短期")[1] and '。'not in c.split("中长期")[1]:
        c = c.split("中长期")[0]
    elif "中长期" in c:
        c = c.split("中长期")[0]
    cut = jieba.cut(c)
    cut_list = []
    for i in cut:
        cut_list.append(i)
    cut_list.reverse()
    print(c)
    print(cut_list)
    for c in cut_list:
        continued = False
        for i in to_continue:
            if i == c:
                continued = True
                break
        if continued:
            continue
        for i in zero:
            if i == c:
                return "0"
        if "滚动操作" in c and "多单滚动操作" not in c and "空单滚动操作" not in c:
            return "0"
        if "持续震荡" in c and "持续震荡偏弱" not in c and "持续震荡偏强" not in c:
            return "0"
        for i in point_8:
            if i == c:
                return "0.8"
        for i in point_7:
            if i == c:
                return "0.7"
        for i in point_5:
            if i == c:
                return "0.5"
        for i in point_3:
            if i == c:
                return "0.3"
        for i in point_neg_8:
            if i == c:
                return "-0.8"
        for i in point_neg_7:
            if i == c:
                return "-0.7"
        for i in point_neg_5:
            if i == c:
                return "-0.5"
        for i in point_neg_3:
            if i == c:
                return "-0.3"
        for i in high:
            if i == c:
                return "1"
        for i in low:
            if i == c:
                return "-1"
    return "0"
